newdigate/teensy-cores/imxrt1176/imxrt1176.h
/* --- LPUART register blocks (Task: Serial1) --- */
#define LPUART1_VERID (*(volatile uint32_t *)0x4007C000u)
#define LPUART1_PARAM (*(volatile uint32_t *)0x4007C004u)
#define LPUART1_GLOBAL (*(volatile uint32_t *)0x4007C008u)
#define LPUART1_PINCFG (*(volatile uint32_t *)0x4007C00Cu)
#define LPUART1_BAUD (*(volatile uint32_t *)0x4007C010u)
#define LPUART1_STAT (*(volatile uint32_t *)0x4007C014u)
#define LPUART1_CTRL (*(volatile uint32_t *)0x4007C018u)
#define LPUART1_DATA (*(volatile uint32_t *)0x4007C01Cu)
#define LPUART1_MATCH (*(volatile uint32_t *)0x4007C020u)
#define LPUART1_MODIR (*(volatile uint32_t *)0x4007C024u)
#define LPUART1_FIFO (*(volatile uint32_t *)0x4007C028u)
#define LPUART1_WATER (*(volatile uint32_t *)0x4007C02Cu)
#define LPUART2_VERID (*(volatile uint32_t *)0x40080000u)
#define LPUART2_PARAM (*(volatile uint32_t *)0x40080004u)
#define LPUART2_GLOBAL (*(volatile uint32_t *)0x40080008u)
#define LPUART2_PINCFG (*(volatile uint32_t *)0x4008000Cu)
#define LPUART2_BAUD (*(volatile uint32_t *)0x40080010u)
#define LPUART2_STAT (*(volatile uint32_t *)0x40080014u)
#define LPUART2_CTRL (*(volatile uint32_t *)0x40080018u)
#define LPUART2_DATA (*(volatile uint32_t *)0x4008001Cu)
#define LPUART2_MATCH (*(volatile uint32_t *)0x40080020u)
#define LPUART2_MODIR (*(volatile uint32_t *)0x40080024u)
#define LPUART2_FIFO (*(volatile uint32_t *)0x40080028u)
#define LPUART2_WATER (*(volatile uint32_t *)0x4008002Cu)
#define LPUART3_VERID (*(volatile uint32_t *)0x40084000u)
#define LPUART3_PARAM (*(volatile uint32_t *)0x40084004u)
#define LPUART3_GLOBAL (*(volatile uint32_t *)0x40084008u)
#define LPUART3_PINCFG (*(volatile uint32_t *)0x4008400Cu)
#define LPUART3_BAUD (*(volatile uint32_t *)0x40084010u)
#define LPUART3_STAT (*(volatile uint32_t *)0x40084014u)
#define LPUART3_CTRL (*(volatile uint32_t *)0x40084018u)
#define LPUART3_DATA (*(volatile uint32_t *)0x4008401Cu)
#define LPUART3_MATCH (*(volatile uint32_t *)0x40084020u)
#define LPUART3_MODIR (*(volatile uint32_t *)0x40084024u)
#define LPUART3_FIFO (*(volatile uint32_t *)0x40084028u)
#define LPUART3_WATER (*(volatile uint32_t *)0x4008402Cu)
#define LPUART4_VERID (*(volatile uint32_t *)0x40088000u)
#define LPUART4_PARAM (*(volatile uint32_t *)0x40088004u)
#define LPUART4_GLOBAL (*(volatile uint32_t *)0x40088008u)
#define LPUART4_PINCFG (*(volatile uint32_t *)0x4008800Cu)
#define LPUART4_BAUD (*(volatile uint32_t *)0x40088010u)
#define LPUART4_STAT (*(volatile uint32_t *)0x40088014u)
#define LPUART4_CTRL (*(volatile uint32_t *)0x40088018u)
#define LPUART4_DATA (*(volatile uint32_t *)0x4008801Cu)
#define LPUART4_MATCH (*(volatile uint32_t *)0x40088020u)
#define LPUART4_MODIR (*(volatile uint32_t *)0x40088024u)
#define LPUART4_FIFO (*(volatile uint32_t *)0x40088028u)
#define LPUART4_WATER (*(volatile uint32_t *)0x4008802Cu)
#define LPUART5_VERID (*(volatile uint32_t *)0x4008C000u)
#define LPUART5_PARAM (*(volatile uint32_t *)0x4008C004u)
#define LPUART5_GLOBAL (*(volatile uint32_t *)0x4008C008u)
#define LPUART5_PINCFG (*(volatile uint32_t *)0x4008C00Cu)
#define LPUART5_BAUD (*(volatile uint32_t *)0x4008C010u)
#define LPUART5_STAT (*(volatile uint32_t *)0x4008C014u)
#define LPUART5_CTRL (*(volatile uint32_t *)0x4008C018u)
#define LPUART5_DATA (*(volatile uint32_t *)0x4008C01Cu)
#define LPUART5_MATCH (*(volatile uint32_t *)0x4008C020u)
#define LPUART5_MODIR (*(volatile uint32_t *)0x4008C024u)
#define LPUART5_FIFO (*(volatile uint32_t *)0x4008C028u)
#define LPUART5_WATER (*(volatile uint32_t *)0x4008C02Cu)
#define LPUART6_VERID (*(volatile uint32_t *)0x40090000u)
#define LPUART6_PARAM (*(volatile uint32_t *)0x40090004u)
#define LPUART6_GLOBAL (*(volatile uint32_t *)0x40090008u)
#define LPUART6_PINCFG (*(volatile uint32_t *)0x4009000Cu)
#define LPUART6_BAUD (*(volatile uint32_t *)0x40090010u)
#define LPUART6_STAT (*(volatile uint32_t *)0x40090014u)
#define LPUART6_CTRL (*(volatile uint32_t *)0x40090018u)
#define LPUART6_DATA (*(volatile uint32_t *)0x4009001Cu)
#define LPUART6_MATCH (*(volatile uint32_t *)0x40090020u)
#define LPUART6_MODIR (*(volatile uint32_t *)0x40090024u)
#define LPUART6_FIFO (*(volatile uint32_t *)0x40090028u)
#define LPUART6_WATER (*(volatile uint32_t *)0x4009002Cu)
#define LPUART7_VERID (*(volatile uint32_t *)0x40094000u)
#define LPUART7_PARAM (*(volatile uint32_t *)0x40094004u)
#define LPUART7_GLOBAL (*(volatile uint32_t *)0x40094008u)
#define LPUART7_PINCFG (*(volatile uint32_t *)0x4009400Cu)
#define LPUART7_BAUD (*(volatile uint32_t *)0x40094010u)
#define LPUART7_STAT (*(volatile uint32_t *)0x40094014u)
#define LPUART7_CTRL (*(volatile uint32_t *)0x40094018u)
#define LPUART7_DATA (*(volatile uint32_t *)0x4009401Cu)
#define LPUART7_MATCH (*(volatile uint32_t *)0x40094020u)
#define LPUART7_MODIR (*(volatile uint32_t *)0x40094024u)
#define LPUART7_FIFO (*(volatile uint32_t *)0x40094028u)
#define LPUART7_WATER (*(volatile uint32_t *)0x4009402Cu)
#define LPUART8_VERID (*(volatile uint32_t *)0x40098000u)
#define LPUART8_PARAM (*(volatile uint32_t *)0x40098004u)
#define LPUART8_GLOBAL (*(volatile uint32_t *)0x40098008u)
#define LPUART8_PINCFG (*(volatile uint32_t *)0x4009800Cu)
#define LPUART8_BAUD (*(volatile uint32_t *)0x40098010u)
#define LPUART8_STAT (*(volatile uint32_t *)0x40098014u)
#define LPUART8_CTRL (*(volatile uint32_t *)0x40098018u)
#define LPUART8_DATA (*(volatile uint32_t *)0x4009801Cu)
#define LPUART8_MATCH (*(volatile uint32_t *)0x40098020u)
#define LPUART8_MODIR (*(volatile uint32_t *)0x40098024u)
#define LPUART8_FIFO (*(volatile uint32_t *)0x40098028u)
#define LPUART8_WATER (*(volatile uint32_t *)0x4009802Cu)
#define LPUART9_VERID (*(volatile uint32_t *)0x4009C000u)
#define LPUART9_PARAM (*(volatile uint32_t *)0x4009C004u)
#define LPUART9_GLOBAL (*(volatile uint32_t *)0x4009C008u)
#define LPUART9_PINCFG (*(volatile uint32_t *)0x4009C00Cu)
#define LPUART9_BAUD (*(volatile uint32_t *)0x4009C010u)
#define LPUART9_STAT (*(volatile uint32_t *)0x4009C014u)
#define LPUART9_CTRL (*(volatile uint32_t *)0x4009C018u)
#define LPUART9_DATA (*(volatile uint32_t *)0x4009C01Cu)
#define LPUART9_MATCH (*(volatile uint32_t *)0x4009C020u)
#define LPUART9_MODIR (*(volatile uint32_t *)0x4009C024u)
#define LPUART9_FIFO (*(volatile uint32_t *)0x4009C028u)
#define LPUART9_WATER (*(volatile uint32_t *)0x4009C02Cu)
#define LPUART10_VERID (*(volatile uint32_t *)0x400A0000u)
#define LPUART10_PARAM (*(volatile uint32_t *)0x400A0004u)
#define LPUART10_GLOBAL (*(volatile uint32_t *)0x400A0008u)
#define LPUART10_PINCFG (*(volatile uint32_t *)0x400A000Cu)
#define LPUART10_BAUD (*(volatile uint32_t *)0x400A0010u)
#define LPUART10_STAT (*(volatile uint32_t *)0x400A0014u)
#define LPUART10_CTRL (*(volatile uint32_t *)0x400A0018u)
#define LPUART10_DATA (*(volatile uint32_t *)0x400A001Cu)
#define LPUART10_MATCH (*(volatile uint32_t *)0x400A0020u)
#define LPUART10_MODIR (*(volatile uint32_t *)0x400A0024u)
#define LPUART10_FIFO (*(volatile uint32_t *)0x400A0028u)
#define LPUART10_WATER (*(volatile uint32_t *)0x400A002Cu)
#define LPUART11_VERID (*(volatile uint32_t *)0x40C24000u)
#define LPUART11_PARAM (*(volatile uint32_t *)0x40C24004u)
#define LPUART11_GLOBAL (*(volatile uint32_t *)0x40C24008u)
#define LPUART11_PINCFG (*(volatile uint32_t *)0x40C2400Cu)
#define LPUART11_BAUD (*(volatile uint32_t *)0x40C24010u)
#define LPUART11_STAT (*(volatile uint32_t *)0x40C24014u)
#define LPUART11_CTRL (*(volatile uint32_t *)0x40C24018u)
#define LPUART11_DATA (*(volatile uint32_t *)0x40C2401Cu)
#define LPUART11_MATCH (*(volatile uint32_t *)0x40C24020u)
#define LPUART11_MODIR (*(volatile uint32_t *)0x40C24024u)
#define LPUART11_FIFO (*(volatile uint32_t *)0x40C24028u)
#define LPUART11_WATER (*(volatile uint32_t *)0x40C2402Cu)
#define LPUART12_VERID (*(volatile uint32_t *)0x40C28000u)
#define LPUART12_PARAM (*(volatile uint32_t *)0x40C28004u)
#define LPUART12_GLOBAL (*(volatile uint32_t *)0x40C28008u)
#define LPUART12_PINCFG (*(volatile uint32_t *)0x40C2800Cu)
#define LPUART12_BAUD (*(volatile uint32_t *)0x40C28010u)
#define LPUART12_STAT (*(volatile uint32_t *)0x40C28014u)
#define LPUART12_CTRL (*(volatile uint32_t *)0x40C28018u)
#define LPUART12_DATA (*(volatile uint32_t *)0x40C2801Cu)
#define LPUART12_MATCH (*(volatile uint32_t *)0x40C28020u)
#define LPUART12_MODIR (*(volatile uint32_t *)0x40C28024u)
#define LPUART12_FIFO (*(volatile uint32_t *)0x40C28028u)
#define LPUART12_WATER (*(volatile uint32_t *)0x40C2802Cu)

