newdigate/teensy-cores/imxrt1176/imxrt1176.h
/* LPUART bitfields (RT1176 RM / PERI_LPUART.h) */
#define LPUART_STAT_RDRF   (1u << 21)
#define LPUART_STAT_TDRE   (1u << 23)
#define LPUART_STAT_TC     (1u << 22)
#define LPUART_STAT_IDLE   (1u << 20)
#define LPUART_STAT_OR     (1u << 19)
#define LPUART_CTRL_RE     (1u << 18)
#define LPUART_CTRL_TE     (1u << 19)
#define LPUART_CTRL_ILIE   (1u << 20)
#define LPUART_CTRL_RIE    (1u << 21)
#define LPUART_CTRL_TCIE   (1u << 22)
#define LPUART_CTRL_TIE    (1u << 23)
#define LPUART_BAUD_SBR(n)   ((uint32_t)(n) & 0x1FFFu)
#define LPUART_BAUD_OSR(n)   (((uint32_t)(n) & 0x1Fu) << 24)
#define LPUART_BAUD_BOTHEDGE (1u << 17)
#define LPUART_FIFO_RXFE   (1u << 3)
#define LPUART_FIFO_TXFE   (1u << 7)
#define LPUART_WATER_TXWATER(n) ((uint32_t)(n) & 0x3u)
#define LPUART_WATER_RXWATER(n) (((uint32_t)(n) << 16) & 0x30000u)

/* LPUART1 console clock + input select (EVKB VCOM) */
#define CCM_CLOCK_ROOT25_CONTROL (*(volatile uint32_t *)0x40CC0C80u)
#define CCM_LPCG86_DIRECT        (*(volatile uint32_t *)0x40CC6AC0u)
#define IOMUXC_LPUART1_TXD_SELECT_INPUT (*(volatile uint32_t *)0x400E8620u)
#define IOMUXC_LPUART1_RXD_SELECT_INPUT (*(volatile uint32_t *)0x400E861Cu)

/* FlexCAN3 (J47): clock root 24 (mux 1 = Osc24MOut, div 1 = 24 MHz) +
 * LPCG 85, and the CAN3 TX/RX pads in the LPSR IOMUXC (0x40C08000). */
#define CCM_CLOCK_ROOT24_CONTROL (*(volatile uint32_t *)0x40CC0C00u)
#define CCM_LPCG85_DIRECT        (*(volatile uint32_t *)0x40CC6AA0u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_LPSR_00 (*(volatile uint32_t *)0x40C08000u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_LPSR_01 (*(volatile uint32_t *)0x40C08004u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_LPSR_00 (*(volatile uint32_t *)0x40C08040u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_LPSR_01 (*(volatile uint32_t *)0x40C08044u)
#define IOMUXC_FLEXCAN3_RX_SELECT_INPUT    (*(volatile uint32_t *)0x40C08080u)

/* --- LPADC register blocks (Task: analogRead) --- */
#define ADC1_VERID (*(volatile uint32_t *)0x40050000u)
#define ADC1_PARAM (*(volatile uint32_t *)0x40050004u)
#define ADC1_CTRL (*(volatile uint32_t *)0x40050010u)
#define ADC1_STAT (*(volatile uint32_t *)0x40050014u)
#define ADC1_IE (*(volatile uint32_t *)0x40050018u)
#define ADC1_DE (*(volatile uint32_t *)0x4005001Cu)
#define ADC1_CFG (*(volatile uint32_t *)0x40050020u)
#define ADC1_PAUSE (*(volatile uint32_t *)0x40050024u)
#define ADC1_FCTRL (*(volatile uint32_t *)0x40050030u)
#define ADC1_SWTRIG (*(volatile uint32_t *)0x40050034u)
#define ADC1_TCTRL0 (*(volatile uint32_t *)0x400500C0u)
#define ADC1_CMDL1 (*(volatile uint32_t *)0x40050100u)
#define ADC1_CMDH1 (*(volatile uint32_t *)0x40050104u)
#define ADC1_RESFIFO (*(volatile uint32_t *)0x40050300u)
#define ADC2_VERID (*(volatile uint32_t *)0x40054000u)
#define ADC2_PARAM (*(volatile uint32_t *)0x40054004u)
#define ADC2_CTRL (*(volatile uint32_t *)0x40054010u)
#define ADC2_STAT (*(volatile uint32_t *)0x40054014u)
#define ADC2_IE (*(volatile uint32_t *)0x40054018u)
#define ADC2_DE (*(volatile uint32_t *)0x4005401Cu)
#define ADC2_CFG (*(volatile uint32_t *)0x40054020u)
#define ADC2_PAUSE (*(volatile uint32_t *)0x40054024u)
#define ADC2_FCTRL (*(volatile uint32_t *)0x40054030u)
#define ADC2_SWTRIG (*(volatile uint32_t *)0x40054034u)
#define ADC2_TCTRL0 (*(volatile uint32_t *)0x400540C0u)
#define ADC2_CMDL1 (*(volatile uint32_t *)0x40054100u)
#define ADC2_CMDH1 (*(volatile uint32_t *)0x40054104u)
#define ADC2_RESFIFO (*(volatile uint32_t *)0x40054300u)

/* LPADC bitfields (RT1176 RM / PERI_ADC.h) */
#define ADC_CTRL_ADCEN   (1u << 0)
#define ADC_CTRL_RST     (1u << 1)
#define ADC_CTRL_RSTFIFO (1u << 8)
#define ADC_STAT_RDY     (1u << 0)
#define ADC_STAT_FOF     (1u << 1)
#define ADC_IE_FWMIE     (1u << 0)
#define ADC_CMDL_ADCH(x)   ((uint32_t)(x) & 0x1Fu)
#define ADC_CMDL_ABSEL     (1u << 5)   /* single-ended: 0 = A-side pad, 1 = B-side pad */
#define ADC_CMDL_CSCALE    (1u << 13)  /* 1 = full scale (SDK default); 0 = input scaled 30/64 */
#define ADC_CMDH_STS(x)    (((uint32_t)(x) & 0x7u) << 8)  /* sample time: 0=3.5 ADCK .. 7=131.5 ADCK */
#define ADC_TCTRL_TCMD(x)  (((uint32_t)(x) & 0xFu) << 24)
#define ADC_FCTRL_FWMARK(x)(((uint32_t)(x) & 0xFu) << 16)
#define ADC_CFG_PWRSEL(x)  (((uint32_t)(x) & 0x3u) << 4)
#define ADC_CFG_REFSEL(x)  (((uint32_t)(x) & 0x3u) << 6)
#define ADC_RESFIFO_D      (0xFFFFu)
#define ADC_RESFIFO_VALID  (1u << 31)

/* LPADC clock roots + LPCG gates */
#define CCM_CLOCK_ROOT9_CONTROL  (*(volatile uint32_t *)0x40CC0480u)
#define CCM_CLOCK_ROOT10_CONTROL (*(volatile uint32_t *)0x40CC0500u)
#define CCM_LPCG55_DIRECT (*(volatile uint32_t *)0x40CC66E0u)
#define CCM_LPCG56_DIRECT (*(volatile uint32_t *)0x40CC6700u)

/* IOMUXC_GPR FlexRAM bank-config registers (base 0x400E4000) */
#define IOMUXC_GPR_GPR14 (*(volatile uint32_t *)0x400E4038u)
#define IOMUXC_GPR_GPR16 (*(volatile uint32_t *)0x400E4040u)
#define IOMUXC_GPR_GPR17 (*(volatile uint32_t *)0x400E4044u)  /* FLEXRAM_BANK_CFG_LOW  (banks 0-7)  */
#define IOMUXC_GPR_GPR18 (*(volatile uint32_t *)0x400E4048u)  /* FLEXRAM_BANK_CFG_HIGH (banks 8-15) */

/* SRC (System Reset Controller, base 0x40C04000) - dual-core reset control.
 * SRSR bitmap (nxp PERI_SRC.h): bit2 M7_LOCKUP, bit12 M4_LOCKUP_M7, bit0/16 POR. */
#define SRC_SRMR (*(volatile uint32_t *)0x40C04004u)  /* [7:6] M4LOCKUP_RESET_MODE, [11:10] M4REQ_RESET_MODE */
#define SRC_SRSR (*(volatile uint32_t *)0x40C04010u)  /* reset status (write 1 to clear) */

/* --- Dual-core (CM7 boots CM4): SRC core-release + IOMUXC_LPSR_GPR CM4 VTOR
 *     + CM4 TCM backdoor + MU messaging unit.  RM ch.25 (SRC), ch.12
 *     (IOMUXC_LPSR_GPR), ch.35 (MU).  Every register/quirk below was
 *     HW-verified on the EVKB by evkb/dualcore_mu_test (2026-07-16).
 *     Consumed by Multicore.{h,cpp} + MessagingUnit.{h,cpp}. --- */
/* SRC dual-core reset/release (base 0x40C04000). */
#define SRC_SCR         (*(volatile uint32_t *)0x40C04000u)  /* boot-release control */
#define SRC_CTRL_M4CORE (*(volatile uint32_t *)0x40C04284u)  /* CM4 reset-slice control */
#define SRC_STAT_M4CORE (*(volatile uint32_t *)0x40C04290u)  /* CM4 reset-slice status */
#define SRC_SCR_BT_RELEASE_M4     (1u << 0)  /* write-1-ONLY: release CM4 from reset (a 0 write is ignored on silicon) */
#define SRC_SCR_BT_RELEASE_M7     (1u << 1)
#define SRC_CTRL_M4CORE_SW_RESET  (1u << 0)  /* self-clearing: SW-reset the CM4 slice (reboots a released CM4 from its VTOR) */
#define SRC_STAT_M4CORE_UNDER_RST (1u << 0)  /* 1 = CM4 held, 0 = released -- the RELIABLE hold indicator (MU ASR.RS bit7 never sets on silicon) */

