newdigate/teensy-cores/imxrt1176/imxrt1176.h
/* IOMUXC_LPSR_GPR CM4 initial vector table (base 0x40C0C000):
 * GPR0[15:3] = CM4_INIT_VTOR[15:3], GPR1[15:0] = CM4_INIT_VTOR[31:16]. */
#define IOMUXC_LPSR_GPR0 (*(volatile uint32_t *)0x40C0C000u)
#define IOMUXC_LPSR_GPR1 (*(volatile uint32_t *)0x40C0C004u)

/* CM4 image staging window: the CM7 reaches the CM4 TCMs through this OCRAM
 * backdoor alias (RM Table 3-1: 0x20200000 -> CM4 ITCM, 0x20220000 -> CM4
 * DTCM).  Stage the image here AND boot from here (VTOR = 0x20200000); a
 * CM4-private TCM-window VTOR (0x1FFE0000) releases the slice but never
 * fetches (EVKB-verified). */
#define CM4_TCM_BACKDOOR   0x20200000u
#define CM4_BOOT_ADDRESS   CM4_TCM_BACKDOOR

/* CCM LPCG1 DIRECT: CM4 core clock gate (0x40CC6000 + 1*0x20).  The boot ROM
 * ungates it and the SDK/Zephyr never touch it; writing 1 is defensive
 * (HW-verified already-on: dualcore_mu_test lpcg=1). */
#define CCM_LPCG1_DIRECT (*(volatile uint32_t *)0x40CC6020u)

/* MU (Messaging Unit), RM ch.35.  This core is Processor A (MUA @ 0x40C48000);
 * the CM4 is Processor B (MUB @ 0x40C4C000).  Classic single-SR/CR layout:
 * TR[4]@0x00 (WO), RR[4]@0x10 (RO), SR@0x20 (GIPn is W1C), CR@0x24.  In every
 * 4-bit field n=0 is the HIGH-order bit (channel 0 -> +3, channel 3 -> +0). */
#define MUA_BASE 0x40C48000u
#define MUB_BASE 0x40C4C000u
#define MUA_TR(n) (*(volatile uint32_t *)(MUA_BASE + 0x00u + ((unsigned)(n) << 2)))
#define MUA_RR(n) (*(volatile uint32_t *)(MUA_BASE + 0x10u + ((unsigned)(n) << 2)))
#define MUA_SR    (*(volatile uint32_t *)(MUA_BASE + 0x20u))
#define MUA_CR    (*(volatile uint32_t *)(MUA_BASE + 0x24u))
#define MUB_SR    (*(volatile uint32_t *)(MUB_BASE + 0x20u))
/* SR fields (n = 0..3): */
#define MU_SR_GIP(n) (1u << (31 - (n)))   /* general-purpose interrupt pending (W1C) */
#define MU_SR_RF(n)  (1u << (27 - (n)))   /* receive-register n full */
#define MU_SR_TE(n)  (1u << (23 - (n)))   /* transmit-register n empty */
#define MU_SR_FUP    (1u << 8)
#define MU_SR_RS     (1u << 7)            /* RM "B in reset"; NEVER sets on RT1176 silicon -- do NOT use */
#define MU_SR_BIT9   (1u << 9)            /* undocumented; ALWAYS reads 1 on RT1176 silicon -- mask off before flag compares */
#define MU_SR_EP     (1u << 4)
#define MU_SR_Fn_MASK 0x7u
/* CR fields (n = 0..3): */
#define MU_CR_GIE(n) (1u << (31 - (n)))   /* general-purpose interrupt enable */
#define MU_CR_RIE(n) (1u << (27 - (n)))   /* receive interrupt enable */
#define MU_CR_TIE(n) (1u << (23 - (n)))   /* transmit interrupt enable */
#define MU_CR_GIR(n) (1u << (19 - (n)))   /* general-purpose interrupt request (auto-clears when peer W1C-acks its GIP) */
#define MU_CR_MUR    (1u << 5)
#define MU_CR_Fn_MASK 0x7u
#define MU_IRQ 118u   /* NVIC line for MU (ORed tx/rx/gp), both cores (RM interrupt table) */

/* LPI2C1 (Arduino-header I2C master), base 0x40104000 */
#define LPI2C1_MCR    (*(volatile uint32_t *)0x40104010u)
#define LPI2C1_MSR    (*(volatile uint32_t *)0x40104014u)
#define LPI2C1_MIER   (*(volatile uint32_t *)0x40104018u)
#define LPI2C1_MCFGR1 (*(volatile uint32_t *)0x40104024u)
#define LPI2C1_MCCR0  (*(volatile uint32_t *)0x40104048u)
#define LPI2C1_MFCR   (*(volatile uint32_t *)0x40104058u)
#define LPI2C1_MTDR   (*(volatile uint32_t *)0x40104060u)
#define LPI2C1_MRDR   (*(volatile uint32_t *)0x40104070u)
/* LPI2C1 clock: CCM_CLOCK_ROOT37 + LPCG98 */
#define CCM_CLOCK_ROOT37_CONTROL (*(volatile uint32_t *)0x40CC1280u)
#define CCM_LPCG98_DIRECT        (*(volatile uint32_t *)0x40CC6C40u)
/* LPI2C1 pins: SCL=GPIO_AD_08, SDA=GPIO_AD_09 (ALT1) */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_08 (*(volatile uint32_t *)0x400E812Cu)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_09 (*(volatile uint32_t *)0x400E8130u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_08 (*(volatile uint32_t *)0x400E8370u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_09 (*(volatile uint32_t *)0x400E8374u)
#define IOMUXC_LPI2C1_SCL_SELECT_INPUT   (*(volatile uint32_t *)0x400E85ACu)
#define IOMUXC_LPI2C1_SDA_SELECT_INPUT   (*(volatile uint32_t *)0x400E85B0u)

/* LPI2C1 slave register block */
#define LPI2C1_SCR    (*(volatile uint32_t *)0x40104110u)
#define LPI2C1_SSR    (*(volatile uint32_t *)0x40104114u)
#define LPI2C1_SIER   (*(volatile uint32_t *)0x40104118u)
#define LPI2C1_SCFGR1 (*(volatile uint32_t *)0x40104124u)
#define LPI2C1_SCFGR2 (*(volatile uint32_t *)0x40104128u)
#define LPI2C1_SAMR   (*(volatile uint32_t *)0x40104140u)
#define LPI2C1_SASR   (*(volatile uint32_t *)0x40104150u)
#define LPI2C1_STAR   (*(volatile uint32_t *)0x40104154u)
#define LPI2C1_STDR   (*(volatile uint32_t *)0x40104160u)
#define LPI2C1_SRDR   (*(volatile uint32_t *)0x40104170u)
/* LPI2C2 (QEMU loopback slave), base 0x40108000 */
#define LPI2C2_MCR    (*(volatile uint32_t *)0x40108010u)
#define LPI2C2_MSR    (*(volatile uint32_t *)0x40108014u)
#define LPI2C2_MIER   (*(volatile uint32_t *)0x40108018u)
#define LPI2C2_MCFGR1 (*(volatile uint32_t *)0x40108024u)
#define LPI2C2_MCCR0  (*(volatile uint32_t *)0x40108048u)
#define LPI2C2_MTDR   (*(volatile uint32_t *)0x40108060u)
#define LPI2C2_MRDR   (*(volatile uint32_t *)0x40108070u)
#define LPI2C2_SCR    (*(volatile uint32_t *)0x40108110u)
#define LPI2C2_SSR    (*(volatile uint32_t *)0x40108114u)
#define LPI2C2_SIER   (*(volatile uint32_t *)0x40108118u)
#define LPI2C2_SCFGR1 (*(volatile uint32_t *)0x40108124u)
#define LPI2C2_SCFGR2 (*(volatile uint32_t *)0x40108128u)
#define LPI2C2_SAMR   (*(volatile uint32_t *)0x40108140u)
#define LPI2C2_SASR   (*(volatile uint32_t *)0x40108150u)
#define LPI2C2_STAR   (*(volatile uint32_t *)0x40108154u)
#define LPI2C2_STDR   (*(volatile uint32_t *)0x40108160u)
#define LPI2C2_SRDR   (*(volatile uint32_t *)0x40108170u)
/* LPI2C2 clock: CCM_CLOCK_ROOT38 + LPCG99 */
#define CCM_CLOCK_ROOT38_CONTROL (*(volatile uint32_t *)0x40CC1300u)
#define CCM_LPCG99_DIRECT        (*(volatile uint32_t *)0x40CC6C60u)

/* LPSPI1 (Arduino-header SPI master), base 0x40114000 */
#define LPSPI1_CR     (*(volatile uint32_t *)0x40114010u)
#define LPSPI1_SR     (*(volatile uint32_t *)0x40114014u)
#define LPSPI1_DER    (*(volatile uint32_t *)0x4011401Cu)
#define LPSPI1_CFGR1  (*(volatile uint32_t *)0x40114024u)
#define LPSPI1_CCR    (*(volatile uint32_t *)0x40114040u)
#define LPSPI1_FCR    (*(volatile uint32_t *)0x40114058u)
#define LPSPI1_TCR    (*(volatile uint32_t *)0x40114060u)
#define LPSPI1_TDR    (*(volatile uint32_t *)0x40114064u)
#define LPSPI1_RSR    (*(volatile uint32_t *)0x40114070u)
#define LPSPI1_RDR    (*(volatile uint32_t *)0x40114074u)
/* LPSPI1 clock: CCM_CLOCK_ROOT43 + LPCG104 (mux 0 = 24 MHz) */
#define CCM_CLOCK_ROOT43_CONTROL (*(volatile uint32_t *)0x40CC1580u)
#define CCM_LPCG104_DIRECT       (*(volatile uint32_t *)0x40CC6D00u)
/* LPSPI1 pins: SCK=GPIO_AD_28, SOUT=GPIO_AD_30, SIN=GPIO_AD_31 (ALT0) */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_28 (*(volatile uint32_t *)0x400E817Cu)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_30 (*(volatile uint32_t *)0x400E8184u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_31 (*(volatile uint32_t *)0x400E8188u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_28 (*(volatile uint32_t *)0x400E83C0u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_30 (*(volatile uint32_t *)0x400E83C8u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_31 (*(volatile uint32_t *)0x400E83CCu)
#define IOMUXC_LPSPI1_SCK_SELECT_INPUT   (*(volatile uint32_t *)0x400E85D0u)
#define IOMUXC_LPSPI1_SDO_SELECT_INPUT   (*(volatile uint32_t *)0x400E85D8u)
#define IOMUXC_LPSPI1_SDI_SELECT_INPUT   (*(volatile uint32_t *)0x400E85D4u)

