newdigate/teensy-cores/imxrt1176/imxrt1176.h
/* LPSPI register-block overlay (for the newdigate/SPI library's port()
 * accessor).  Layout matches cores/teensy4/imxrt.h IMXRT_LPSPI_t; verified
 * against the flat LPSPI1_* offsets above (base 0x40114000). */
typedef struct {
	volatile uint32_t VERID;    // 0x00
	volatile uint32_t PARAM;    // 0x04
	volatile uint32_t unused08; // 0x08
	volatile uint32_t unused0C; // 0x0C
	volatile uint32_t CR;       // 0x10
	volatile uint32_t SR;       // 0x14
	volatile uint32_t IER;      // 0x18
	volatile uint32_t DER;      // 0x1C
	volatile uint32_t CFGR0;    // 0x20
	volatile uint32_t CFGR1;    // 0x24
	volatile uint32_t unused28; // 0x28
	volatile uint32_t unused2C; // 0x2C
	volatile uint32_t DMR0;     // 0x30
	volatile uint32_t DMR1;     // 0x34
	volatile uint32_t unused38; // 0x38
	volatile uint32_t unused3C; // 0x3C
	volatile uint32_t CCR;      // 0x40
	volatile uint32_t unused44[5]; // 0x44..0x54
	volatile uint32_t FCR;      // 0x58
	volatile uint32_t FSR;      // 0x5C
	volatile uint32_t TCR;      // 0x60
	volatile uint32_t TDR;      // 0x64
	volatile uint32_t unused68; // 0x68
	volatile uint32_t unused6C; // 0x6C
	volatile uint32_t RSR;      // 0x70
	volatile uint32_t RDR;      // 0x74
} IMXRT_LPSPI_t;
#define IMXRT_LPSPI1_ADDRESS 0x40114000

/* LPI2C register-block overlay (for the newdigate/Wire library's port()
 * accessor).  Layout matches cores/teensy4/imxrt.h IMXRT_LPI2C_t; verified
 * against the flat LPI2C1_* offsets above.  Master block 0x10..0x70, then a
 * gap, slave block 0x110..0x170.  Same layout at all 3 bases (LPI2C1
 * 0x40104000, LPI2C2 0x40108000, LPI2C5 0x40C34000). */
typedef struct {
	volatile uint32_t VERID;        // 0x00
	volatile uint32_t PARAM;        // 0x04
	volatile uint32_t unused08;     // 0x08
	volatile uint32_t unused0C;     // 0x0C
	volatile uint32_t MCR;          // 0x10
	volatile uint32_t MSR;          // 0x14
	volatile uint32_t MIER;         // 0x18
	volatile uint32_t MDER;         // 0x1C
	volatile uint32_t MCFGR0;       // 0x20
	volatile uint32_t MCFGR1;       // 0x24
	volatile uint32_t MCFGR2;       // 0x28
	volatile uint32_t MCFGR3;       // 0x2C
	volatile uint32_t unused30[4];  // 0x30..0x3C
	volatile uint32_t MDMR;         // 0x40
	volatile uint32_t unused44;     // 0x44
	volatile uint32_t MCCR0;        // 0x48
	volatile uint32_t unused4C;     // 0x4C
	volatile uint32_t MCCR1;        // 0x50
	volatile uint32_t unused54;     // 0x54
	volatile uint32_t MFCR;         // 0x58
	volatile uint32_t MFSR;         // 0x5C
	volatile uint32_t MTDR;         // 0x60
	volatile uint32_t unused64[3];  // 0x64..0x6C
	volatile uint32_t MRDR;         // 0x70
	volatile uint32_t unused74[39]; // 0x74..0x10C
	volatile uint32_t SCR;          // 0x110
	volatile uint32_t SSR;          // 0x114
	volatile uint32_t SIER;         // 0x118
	volatile uint32_t SDER;         // 0x11C
	volatile uint32_t unused120;    // 0x120
	volatile uint32_t SCFGR1;       // 0x124
	volatile uint32_t SCFGR2;       // 0x128
	volatile uint32_t unused12C[5]; // 0x12C..0x13C
	volatile uint32_t SAMR;         // 0x140
	volatile uint32_t unused144[3]; // 0x144..0x14C
	volatile uint32_t SASR;         // 0x150
	volatile uint32_t STAR;         // 0x154
	volatile uint32_t unused158[2]; // 0x158..0x15C
	volatile uint32_t STDR;         // 0x160
	volatile uint32_t unused164[3]; // 0x164..0x16C
	volatile uint32_t SRDR;         // 0x170
} IMXRT_LPI2C_t;
#define IMXRT_LPI2C1_ADDRESS 0x40104000
#define IMXRT_LPI2C2_ADDRESS 0x40108000
#define IMXRT_LPI2C5_ADDRESS 0x40C34000

/* USDHC1 microSD pins (EVKB J15): CMD/CLK/DATA0-3 = GPIO_SD_B1_00..05, ALT0 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_00 (*(volatile uint32_t *)0x400E819Cu)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_01 (*(volatile uint32_t *)0x400E81A0u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_02 (*(volatile uint32_t *)0x400E81A4u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_03 (*(volatile uint32_t *)0x400E81A8u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_04 (*(volatile uint32_t *)0x400E81ACu)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_05 (*(volatile uint32_t *)0x400E81B0u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_00 (*(volatile uint32_t *)0x400E83E0u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_01 (*(volatile uint32_t *)0x400E83E4u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_02 (*(volatile uint32_t *)0x400E83E8u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_03 (*(volatile uint32_t *)0x400E83ECu)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_04 (*(volatile uint32_t *)0x400E83F0u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_05 (*(volatile uint32_t *)0x400E83F4u)
/* USDHC1 clock root 58 (SYS_PLL2_PFD2 / 2) + gate LPCG117 */
#define CCM_CLOCK_ROOT58_CONTROL (*(volatile uint32_t *)0x40CC1D00u)
#define CCM_LPCG117_DIRECT       (*(volatile uint32_t *)0x40CC6EA0u)

/* USDHC register-block overlay (for the SdFat SdioTeensy __IMXRT1176__ port).
 * Layout matches cores/teensy4/imxrt.h IMXRT_USDHC_t; only the base addresses
 * differ from the 1062 (0x40418000/0x4041C000 vs 0x402C0000/0x402C4000). */
typedef struct {
	volatile uint32_t DS_ADDR;              // 0x00
	volatile uint32_t BLK_ATT;              // 0x04
	volatile uint32_t CMD_ARG;              // 0x08
	volatile uint32_t CMD_XFR_TYP;          // 0x0C
	volatile uint32_t CMD_RSP0;             // 0x10
	volatile uint32_t CMD_RSP1;             // 0x14
	volatile uint32_t CMD_RSP2;             // 0x18
	volatile uint32_t CMD_RSP3;             // 0x1C
	volatile uint32_t DATA_BUFF_ACC_PORT;   // 0x20
	volatile uint32_t PRES_STATE;           // 0x24
	volatile uint32_t PROT_CTRL;            // 0x28
	volatile uint32_t SYS_CTRL;             // 0x2C
	volatile uint32_t INT_STATUS;           // 0x30
	volatile uint32_t INT_STATUS_EN;        // 0x34
	volatile uint32_t INT_SIGNAL_EN;        // 0x38
	volatile uint32_t AUTOCMD12_ERR_STATUS; // 0x3C
	volatile uint32_t HOST_CTRL_CAP;        // 0x40
	volatile uint32_t WTMK_LVL;             // 0x44
	volatile uint32_t MIX_CTRL;             // 0x48
	uint32_t unused1;                       // 0x4C
	volatile uint32_t FORCE_EVENT;          // 0x50
	volatile uint32_t ADMA_ERR_STATUS;      // 0x54
	volatile uint32_t ADMA_SYS_ADDR;        // 0x58
	uint32_t unused2;                       // 0x5C
	volatile uint32_t DLL_CTRL;             // 0x60
	volatile uint32_t DLL_STATUS;           // 0x64
	volatile uint32_t CLK_TUNE_CTRL_STATUS; // 0x68
	uint32_t unused3[21];                   // 0x6C..0xBC
	volatile uint32_t VEND_SPEC;            // 0xC0
	volatile uint32_t MMC_BOOT;             // 0xC4
	volatile uint32_t VEND_SPEC2;           // 0xC8
	volatile uint32_t TUNING_CTRL;          // 0xCC
} IMXRT_USDHC_t;
#define IMXRT_USDHC1_ADDRESS 0x40418000
#define IMXRT_USDHC2_ADDRESS 0x4041C000
#define IMXRT_USDHC1 (*(IMXRT_USDHC_t *)IMXRT_USDHC1_ADDRESS)
#define IMXRT_USDHC2 (*(IMXRT_USDHC_t *)IMXRT_USDHC2_ADDRESS)
#define USDHC1_DS_ADDR (IMXRT_USDHC1.DS_ADDR)
#define USDHC1_BLK_ATT (IMXRT_USDHC1.BLK_ATT)
#define USDHC1_CMD_ARG (IMXRT_USDHC1.CMD_ARG)
#define USDHC1_CMD_XFR_TYP (IMXRT_USDHC1.CMD_XFR_TYP)
#define USDHC1_CMD_RSP0 (IMXRT_USDHC1.CMD_RSP0)
#define USDHC1_CMD_RSP1 (IMXRT_USDHC1.CMD_RSP1)
#define USDHC1_CMD_RSP2 (IMXRT_USDHC1.CMD_RSP2)
#define USDHC1_CMD_RSP3 (IMXRT_USDHC1.CMD_RSP3)
#define USDHC1_DATA_BUFF_ACC_PORT (IMXRT_USDHC1.DATA_BUFF_ACC_PORT)
#define USDHC1_PRES_STATE (IMXRT_USDHC1.PRES_STATE)
#define USDHC1_PROT_CTRL (IMXRT_USDHC1.PROT_CTRL)
#define USDHC1_SYS_CTRL (IMXRT_USDHC1.SYS_CTRL)
#define USDHC1_INT_STATUS (IMXRT_USDHC1.INT_STATUS)
#define USDHC1_INT_STATUS_EN (IMXRT_USDHC1.INT_STATUS_EN)
#define USDHC1_INT_SIGNAL_EN (IMXRT_USDHC1.INT_SIGNAL_EN)
#define USDHC1_AUTOCMD12_ERR_STATUS (IMXRT_USDHC1.AUTOCMD12_ERR_STATUS)
#define USDHC1_HOST_CTRL_CAP (IMXRT_USDHC1.HOST_CTRL_CAP)
#define USDHC1_WTMK_LVL (IMXRT_USDHC1.WTMK_LVL)
#define USDHC1_MIX_CTRL (IMXRT_USDHC1.MIX_CTRL)
#define USDHC1_FORCE_EVENT (IMXRT_USDHC1.FORCE_EVENT)
#define USDHC1_ADMA_ERR_STATUS (IMXRT_USDHC1.ADMA_ERR_STATUS)
#define USDHC1_ADMA_SYS_ADDR (IMXRT_USDHC1.ADMA_SYS_ADDR)
#define USDHC1_DLL_CTRL (IMXRT_USDHC1.DLL_CTRL)
#define USDHC1_DLL_STATUS (IMXRT_USDHC1.DLL_STATUS)
#define USDHC1_CLK_TUNE_CTRL_STATUS (IMXRT_USDHC1.CLK_TUNE_CTRL_STATUS)
#define USDHC1_VEND_SPEC (IMXRT_USDHC1.VEND_SPEC)
#define USDHC1_MMC_BOOT (IMXRT_USDHC1.MMC_BOOT)
#define USDHC1_VEND_SPEC2 (IMXRT_USDHC1.VEND_SPEC2)
#define USDHC1_TUNING_CTRL (IMXRT_USDHC1.TUNING_CTRL)
#define USDHC2_DS_ADDR (IMXRT_USDHC2.DS_ADDR)
#define USDHC2_BLK_ATT (IMXRT_USDHC2.BLK_ATT)
#define USDHC2_CMD_ARG (IMXRT_USDHC2.CMD_ARG)
#define USDHC2_CMD_XFR_TYP (IMXRT_USDHC2.CMD_XFR_TYP)
#define USDHC2_CMD_RSP0 (IMXRT_USDHC2.CMD_RSP0)
#define USDHC2_CMD_RSP1 (IMXRT_USDHC2.CMD_RSP1)
#define USDHC2_CMD_RSP2 (IMXRT_USDHC2.CMD_RSP2)
#define USDHC2_CMD_RSP3 (IMXRT_USDHC2.CMD_RSP3)
#define USDHC2_DATA_BUFF_ACC_PORT (IMXRT_USDHC2.DATA_BUFF_ACC_PORT)
#define USDHC2_PRES_STATE (IMXRT_USDHC2.PRES_STATE)
#define USDHC2_PROT_CTRL (IMXRT_USDHC2.PROT_CTRL)
#define USDHC2_SYS_CTRL (IMXRT_USDHC2.SYS_CTRL)
#define USDHC2_INT_STATUS (IMXRT_USDHC2.INT_STATUS)
#define USDHC2_INT_STATUS_EN (IMXRT_USDHC2.INT_STATUS_EN)
#define USDHC2_INT_SIGNAL_EN (IMXRT_USDHC2.INT_SIGNAL_EN)
#define USDHC2_AUTOCMD12_ERR_STATUS (IMXRT_USDHC2.AUTOCMD12_ERR_STATUS)
#define USDHC2_HOST_CTRL_CAP (IMXRT_USDHC2.HOST_CTRL_CAP)
#define USDHC2_WTMK_LVL (IMXRT_USDHC2.WTMK_LVL)
#define USDHC2_MIX_CTRL (IMXRT_USDHC2.MIX_CTRL)
#define USDHC2_FORCE_EVENT (IMXRT_USDHC2.FORCE_EVENT)
#define USDHC2_ADMA_ERR_STATUS (IMXRT_USDHC2.ADMA_ERR_STATUS)
#define USDHC2_ADMA_SYS_ADDR (IMXRT_USDHC2.ADMA_SYS_ADDR)
#define USDHC2_DLL_CTRL (IMXRT_USDHC2.DLL_CTRL)
#define USDHC2_DLL_STATUS (IMXRT_USDHC2.DLL_STATUS)
#define USDHC2_CLK_TUNE_CTRL_STATUS (IMXRT_USDHC2.CLK_TUNE_CTRL_STATUS)
#define USDHC2_VEND_SPEC (IMXRT_USDHC2.VEND_SPEC)
#define USDHC2_MMC_BOOT (IMXRT_USDHC2.MMC_BOOT)
#define USDHC2_VEND_SPEC2 (IMXRT_USDHC2.VEND_SPEC2)
#define USDHC2_TUNING_CTRL (IMXRT_USDHC2.TUNING_CTRL)

/* Digital header GPIO bases (GPIO8/9/11/12_BASE already defined above) */
/* Arduino-header pin pads (GPIO ALT = 0xA) */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_DISP_B2_10 (*(volatile uint32_t *)0x400E823Cu)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_DISP_B2_11 (*(volatile uint32_t *)0x400E8240u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_DISP_B2_12 (*(volatile uint32_t *)0x400E8244u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_DISP_B2_10 (*(volatile uint32_t *)0x400E8480u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_DISP_B2_11 (*(volatile uint32_t *)0x400E8484u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_DISP_B2_12 (*(volatile uint32_t *)0x400E8488u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_LPSR_04 (*(volatile uint32_t *)0x40C08010u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_LPSR_05 (*(volatile uint32_t *)0x40C08014u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_LPSR_04 (*(volatile uint32_t *)0x40C08050u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_LPSR_05 (*(volatile uint32_t *)0x40C08054u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_00 (*(volatile uint32_t *)0x400E810Cu)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_01 (*(volatile uint32_t *)0x400E8110u)
/* IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_04 already defined above */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_05 (*(volatile uint32_t *)0x400E8120u)
/* IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_06 already defined above */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_07 (*(volatile uint32_t *)0x400E8128u)
/* IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_08/09 already defined above (LPI2C1 block) */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_10 (*(volatile uint32_t *)0x400E8134u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_11 (*(volatile uint32_t *)0x400E8138u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_12 (*(volatile uint32_t *)0x400E813Cu)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_13 (*(volatile uint32_t *)0x400E8140u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_14 (*(volatile uint32_t *)0x400E8144u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_29 (*(volatile uint32_t *)0x400E8180u)
/* IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_28/30/31 already defined above (LPSPI1 block) */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_00 (*(volatile uint32_t *)0x400E8350u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_01 (*(volatile uint32_t *)0x400E8354u)
/* IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_04 already defined above */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_05 (*(volatile uint32_t *)0x400E8364u)
/* IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_06 already defined above */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_07 (*(volatile uint32_t *)0x400E836Cu)
/* IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_08/09 already defined above (LPI2C1 block) */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_10 (*(volatile uint32_t *)0x400E8378u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_11 (*(volatile uint32_t *)0x400E837Cu)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_12 (*(volatile uint32_t *)0x400E8380u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_13 (*(volatile uint32_t *)0x400E8384u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_14 (*(volatile uint32_t *)0x400E8388u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_29 (*(volatile uint32_t *)0x400E83C4u)
/* IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_28/30/31 already defined above (LPSPI1 block) */
/* FlexPWM (analogWrite): module bases + per-module clock gates */
#define FLEXPWM1_BASE 0x4018C000u
#define FLEXPWM2_BASE 0x40190000u
#define FLEXPWM3_BASE 0x40194000u
#define FLEXPWM4_BASE 0x40198000u
#define CCM_LPCG79_DIRECT (*(volatile uint32_t *)0x40CC69E0u)  /* FlexPWM1 */
#define CCM_LPCG81_DIRECT (*(volatile uint32_t *)0x40CC6A20u)  /* FlexPWM3 */

