newdigate/teensy-cores/imxrt1176/imxrt1176.h
/* Extra generic USB_* bit masks referenced by imxrt_usbhs.h's host block but
 * not used by the device (USB1) side, hence absent from the device masks
 * above.  Standard EHCI / ChipIdea positions, each cross-checked against the
 * CMSIS PERI_USB.h *_MASK defines.  (RS / RST / PCE / UEE / TI0 / TI1 / PR /
 * HSP / USBMODE_CM and the GPTIMER RST/RUN masks already exist with the device
 * block; USBSTS UAI/UPI are inlined literally in imxrt_usbhs.h, not here.) */
/* USBCMD */
#define USB_USBCMD_FS_1(n)     (((n) & 0x3u) << 2)
#define USB_USBCMD_PSE         (1u << 4)
#define USB_USBCMD_ASE         (1u << 5)
#define USB_USBCMD_IAA         (1u << 6)
#define USB_USBCMD_ASP(n)      (((n) & 0x3u) << 8)
#define USB_USBCMD_ASPE        (1u << 11)
#define USB_USBCMD_FS_2        (1u << 15)
#define USB_USBCMD_ITC(n)      (((n) & 0xFFu) << 16)
/* USBSTS */
#define USB_USBSTS_SEI         (1u << 4)
#define USB_USBSTS_AAI         (1u << 5)
#define USB_USBSTS_HCH         (1u << 12)
#define USB_USBSTS_AS          (1u << 15)
#define USB_USBSTS_NAKI        (1u << 16)
/* USBINTR */
#define USB_USBINTR_SEE        (1u << 4)
#define USB_USBINTR_UAIE       (1u << 18)
#define USB_USBINTR_UPIE       (1u << 19)
#define USB_USBINTR_TIE1       (1u << 25)
/* PORTSC1 */
#define USB_PORTSC1_CCS        (1u << 0)
#define USB_PORTSC1_CSC        (1u << 1)
#define USB_PORTSC1_PE         (1u << 2)
#define USB_PORTSC1_PEC        (1u << 3)
#define USB_PORTSC1_OCC        (1u << 5)
#define USB_PORTSC1_FPR        (1u << 6)
#define USB_PORTSC1_PP         (1u << 12)
#define USB_PORTSC1_PFSC       (1u << 24)

/* --- SAI1 (I2S TX, Arduino audio) base 0x40404000, IRQ 76 --- */
#define SAI1_TCSR (*(volatile uint32_t *)0x40404008u)
#define SAI1_TCR1 (*(volatile uint32_t *)0x4040400Cu)
#define SAI1_TCR2 (*(volatile uint32_t *)0x40404010u)
#define SAI1_TCR3 (*(volatile uint32_t *)0x40404014u)
#define SAI1_TCR4 (*(volatile uint32_t *)0x40404018u)
#define SAI1_TCR5 (*(volatile uint32_t *)0x4040401Cu)
#define SAI1_TDR0 (*(volatile uint32_t *)0x40404020u)
#define SAI1_TFR0 (*(volatile uint32_t *)0x40404040u)
#define SAI1_TMR  (*(volatile uint32_t *)0x40404060u)
#define SAI_TCSR_TE  (1u << 31)
#define SAI_TCSR_BCE (1u << 28)
#define SAI_TCSR_FR  (1u << 25)
#define SAI_TCSR_SR  (1u << 24)
#define SAI_TCSR_FEF (1u << 18)
#define SAI_TCSR_FWF (1u << 17)
#define SAI_TCSR_FRF (1u << 16)
#define SAI_TCSR_FRDE (1u << 0)
#define SAI_TCR2_DIV(x)  ((uint32_t)(x) & 0xFFu)
#define SAI_TCR2_BCD (1u << 24)
#define SAI_TCR2_BCP (1u << 25)
#define SAI_TCR2_MSEL(x) (((uint32_t)(x) & 0x3u) << 26)
#define SAI_TCR3_TCE(x)  (((uint32_t)(x) & 0xFu) << 16)
#define SAI_TCR4_FSD (1u << 0)
#define SAI_TCR4_FSP (1u << 1)
#define SAI_TCR4_FSE (1u << 3)
#define SAI_TCR4_MF  (1u << 4)
#define SAI_TCR4_SYWD(x) (((uint32_t)(x) & 0x1Fu) << 8)
#define SAI_TCR4_FRSZ(x) (((uint32_t)(x) & 0x1Fu) << 16)
#define SAI_TCR5_FBT(x)  (((uint32_t)(x) & 0x1Fu) << 8)
#define SAI_TCR5_W0W(x)  (((uint32_t)(x) & 0x1Fu) << 16)
#define SAI_TCR5_WNW(x)  (((uint32_t)(x) & 0x1Fu) << 24)
/* SAI1 clock: root 64 (mux 4 = Audio PLL, div 16), LPCG 123 */
#define CCM_CLOCK_ROOT64_CONTROL (*(volatile uint32_t *)0x40CC2000u)
#define CCM_LPCG123_DIRECT       (*(volatile uint32_t *)0x40CC6F60u)
/* SAI1 pins (ALT0, pad 0x02); TX are outputs, no select_input */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_17 (*(volatile uint32_t *)0x400E8150u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_21 (*(volatile uint32_t *)0x400E8160u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_22 (*(volatile uint32_t *)0x400E8164u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_23 (*(volatile uint32_t *)0x400E8168u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_17 (*(volatile uint32_t *)0x400E8394u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_21 (*(volatile uint32_t *)0x400E83A4u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_22 (*(volatile uint32_t *)0x400E83A8u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_23 (*(volatile uint32_t *)0x400E83ACu)
#define IOMUXC_GPR_GPR0 (*(volatile uint32_t *)0x400E4000u)
#define IOMUXC_GPR_GPR0_SAI1_MCLK_DIR (1u << 8)
/* --- SAI1 RX (receive): registers mirror TX; bit positions identical --- */
#define SAI1_RCSR (*(volatile uint32_t *)0x40404088u)
#define SAI1_RCR1 (*(volatile uint32_t *)0x4040408Cu)
#define SAI1_RCR2 (*(volatile uint32_t *)0x40404090u)
#define SAI1_RCR3 (*(volatile uint32_t *)0x40404094u)
#define SAI1_RCR4 (*(volatile uint32_t *)0x40404098u)
#define SAI1_RCR5 (*(volatile uint32_t *)0x4040409Cu)
#define SAI1_RDR0 (*(volatile uint32_t *)0x404040A0u)
#define SAI1_RFR0 (*(volatile uint32_t *)0x404040C0u)
#define SAI1_RMR  (*(volatile uint32_t *)0x404040E0u)
#define SAI_RCSR_RE   (1u << 31)
#define SAI_RCSR_BCE  (1u << 28)
#define SAI_RCSR_FR   (1u << 25)
#define SAI_RCSR_SR   (1u << 24)
#define SAI_RCSR_FEF  (1u << 18)
#define SAI_RCSR_FWF  (1u << 17)
#define SAI_RCSR_FRF  (1u << 16)
#define SAI_RCSR_FRDE (1u << 0)
#define SAI_RCR2_SYNC(x) (((uint32_t)(x) & 0x3u) << 30)
#define SAI_RCR3_RCE(x)  (((uint32_t)(x) & 0xFu) << 16)
#define SAI_RCR4_FSP (1u << 1)
#define SAI_RCR4_FSE (1u << 3)
#define SAI_RCR4_MF  (1u << 4)
#define SAI_RCR4_SYWD(x) (((uint32_t)(x) & 0x1Fu) << 8)
#define SAI_RCR4_FRSZ(x) (((uint32_t)(x) & 0x1Fu) << 16)
#define SAI_RCR5_FBT(x)  (((uint32_t)(x) & 0x1Fu) << 8)
#define SAI_RCR5_W0W(x)  (((uint32_t)(x) & 0x1Fu) << 16)
#define SAI_RCR5_WNW(x)  (((uint32_t)(x) & 0x1Fu) << 24)
/* SAI1_RXD[0] = GPIO_AD_20 (ALT0); RX data is an input -> needs select_input */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_20 (*(volatile uint32_t *)0x400E815Cu)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_20 (*(volatile uint32_t *)0x400E83A0u)
#define IOMUXC_SAI1_RX_DATA0_SELECT_INPUT (*(volatile uint32_t *)0x400E8674u)

/* --- Audio PLL via ANATOP AI indirect interface (base 0x40C84000) --- */
#define ANADIG_PLL_AUDIO_CTRL (*(volatile uint32_t *)0x40C84300u)
#define ANADIG_PLL_AUDIO_CTRL_ENABLE_CLK (1u << 13)
#define ANADIG_PLL_AUDIO_CTRL_GATE       (1u << 14)
#define ANADIG_PLL_AUDIO_CTRL_STABLE     (1u << 29)
#define ANADIG_MISC_AI_CTRL_AUDIO  (*(volatile uint32_t *)0x40C84880u)
#define ANADIG_MISC_AI_WDATA_AUDIO (*(volatile uint32_t *)0x40C84890u)
#define ANADIG_MISC_AI_RDATA_AUDIO (*(volatile uint32_t *)0x40C848A0u)
#define ANADIG_AI_TOGGLE      (1u << 8)
#define ANADIG_AI_TOGGLE_DONE (1u << 9)
#define ANADIG_AI_RWB         (1u << 16)
#define ANADIG_AI_ADDR_MASK   (0xFFu)

