newdigate/teensy-cores/imxrt1176/imxrt1176.h
/* --- VIDEO PLL via ANATOP AI indirect interface + PLL LDO (display clock) ---
 * The VIDEO PLL's real config (POWER_UP / BYPASS / HOLD_RING_OFF / DIV_SELECT /
 * NUM / DENOM) is NOT in the bus-visible PLL_VIDEO_CTRL (0x40C84350, in the
 * display register block below) -- it lives in AI-space CTRL0/CTRL2/CTRL3
 * reached only through this indirect interface, exactly like the AUDIO PLL
 * above.  fsl_clock.c CLOCK_InitVideoPll() + fsl_anatop_ai.c (kAI_Itf_Video).
 * The toggle/done/rwb/addr bits are shared with the audio interface. */
#define ANADIG_MISC_AI_CTRL_VIDEO  (*(volatile uint32_t *)0x40C848B0u)
#define ANADIG_MISC_AI_WDATA_VIDEO (*(volatile uint32_t *)0x40C848C0u)
#define ANADIG_MISC_AI_RDATA_VIDEO (*(volatile uint32_t *)0x40C848D0u)
/* LDO AI channel (VDDSOC): PMU_StaticEnablePllLdo drives the PHY_LDO through it;
 * the commit is a toggle of PMU_LDO_PLL[16], not a MISC AI_CTRL bit. */
#define ANADIG_MISC_AI_CTRL_LDO    (*(volatile uint32_t *)0x40C84820u)
#define ANADIG_MISC_AI_WDATA_LDO   (*(volatile uint32_t *)0x40C84830u)
#define ANADIG_MISC_AI_RDATA_LDO   (*(volatile uint32_t *)0x40C84840u)
#define ANADIG_PMU_LDO_PLL         (*(volatile uint32_t *)0x40C84500u)
#define ANADIG_PMU_LDO_PLL_AI_TOGGLE (1u << 16)
#define ANADIG_PMU_REF_CTRL        (*(volatile uint32_t *)0x40C84570u)
#define ANADIG_PMU_REF_CTRL_EN_PLL_VOL_REF_BUFFER (1u << 4)

/* --- LPI2C5 (codec bus, LPSR domain) base 0x40C34000, IRQ 36 --- */
#define LPI2C5_MCR    (*(volatile uint32_t *)0x40C34010u)
#define LPI2C5_MSR    (*(volatile uint32_t *)0x40C34014u)
#define LPI2C5_MIER   (*(volatile uint32_t *)0x40C34018u)
#define LPI2C5_MCFGR1 (*(volatile uint32_t *)0x40C34024u)
#define LPI2C5_MCCR0  (*(volatile uint32_t *)0x40C34048u)
#define LPI2C5_MFCR   (*(volatile uint32_t *)0x40C34058u)
#define LPI2C5_MTDR   (*(volatile uint32_t *)0x40C34060u)
#define LPI2C5_MRDR   (*(volatile uint32_t *)0x40C34070u)
#define LPI2C5_SCR    (*(volatile uint32_t *)0x40C34110u)
#define LPI2C5_SSR    (*(volatile uint32_t *)0x40C34114u)
#define LPI2C5_SIER   (*(volatile uint32_t *)0x40C34118u)
#define LPI2C5_SCFGR1 (*(volatile uint32_t *)0x40C34124u)
#define LPI2C5_SCFGR2 (*(volatile uint32_t *)0x40C34128u)
#define LPI2C5_SAMR   (*(volatile uint32_t *)0x40C34140u)
#define LPI2C5_SASR   (*(volatile uint32_t *)0x40C34150u)
#define LPI2C5_STAR   (*(volatile uint32_t *)0x40C34154u)
#define LPI2C5_STDR   (*(volatile uint32_t *)0x40C34160u)
#define LPI2C5_SRDR   (*(volatile uint32_t *)0x40C34170u)
/* LPI2C5 clock: root 41 (mux 1), LPCG 102 */
#define CCM_CLOCK_ROOT41_CONTROL (*(volatile uint32_t *)0x40CC1480u)
#define CCM_LPCG102_DIRECT       (*(volatile uint32_t *)0x40CC6CC0u)
/* LPI2C5 pins (LPSR IOMUXC 0x40C08000): SCL=LPSR_05, SDA=LPSR_04.
 * The LPSR_04/05 mux+pad macros ALREADY exist in the digital-pin block,
 * so only the two SELECT_INPUT (daisy) registers are added here. */
#define IOMUXC_LPI2C5_SCL_SELECT_INPUT (*(volatile uint32_t *)0x40C08084u)
#define IOMUXC_LPI2C5_SDA_SELECT_INPUT (*(volatile uint32_t *)0x40C08088u)

/* ---- eDMA + DMAMUX (classic Freescale eDMA: 32 channels, 16 IRQs) ----------
 * RT1176 uses the SAME IP as RT1062 (Teensy 4), relocated: eDMA 0x40070000,
 * DMAMUX 0x40074000.  cores/teensy4/DMAChannel.{h,cpp} ports with only base
 * retargets.  DMAMUX source numbers are RT1176-specific (NOT the RT1062 values;
 * verified against NXP PERI_DMAMUX.h and QEMU).  TCD0 at 0x40071000, stride 0x20.
 * Channel completion IRQs are NVIC 0..15 (channel n and n+16 share vector n);
 * DMA error is NVIC 16. */
/* eDMA control/status (base 0x40070000) */
#define DMA_CR       (*(volatile uint32_t *)0x40070000u)
#define DMA_ES       (*(volatile uint32_t *)0x40070004u)
#define DMA_ERQ      (*(volatile uint32_t *)0x4007000Cu)
#define DMA_EEI      (*(volatile uint32_t *)0x40070014u)
#define DMA_CEEI     (*(volatile uint8_t  *)0x40070018u)
#define DMA_SEEI     (*(volatile uint8_t  *)0x40070019u)
#define DMA_CERQ     (*(volatile uint8_t  *)0x4007001Au)
#define DMA_SERQ     (*(volatile uint8_t  *)0x4007001Bu)
#define DMA_CDNE     (*(volatile uint8_t  *)0x4007001Cu)
#define DMA_SSRT     (*(volatile uint8_t  *)0x4007001Du)
#define DMA_CERR     (*(volatile uint8_t  *)0x4007001Eu)
#define DMA_CINT     (*(volatile uint8_t  *)0x4007001Fu)
#define DMA_INT      (*(volatile uint32_t *)0x40070024u)
#define DMA_ERR      (*(volatile uint32_t *)0x4007002Cu)
#define DMA_HRS      (*(volatile uint32_t *)0x40070034u)
#define DMA_DCHPRI3  (*(volatile uint8_t  *)0x40070100u)   /* byte-swizzled priority array base */
/* DMA_CR bits */
#define DMA_CR_GRP1PRI ((uint32_t)(1<<10))
#define DMA_CR_EMLM    ((uint32_t)(1<<7))
#define DMA_CR_EDBG    ((uint32_t)(1<<1))
/* DMA_DCHPRIn bits */
#define DMA_DCHPRI_ECP ((uint8_t)(1<<7))
#define DMA_DCHPRI_DPA ((uint8_t)(1<<6))
/* TCD CSR bits */
#define DMA_TCD_CSR_DONE                 0x0080
#define DMA_TCD_CSR_MAJORELINK           0x0020
#define DMA_TCD_CSR_ESG                  0x0010
#define DMA_TCD_CSR_DREQ                 0x0008
#define DMA_TCD_CSR_INTHALF              0x0004
#define DMA_TCD_CSR_INTMAJOR             0x0002
#define DMA_TCD_CSR_START                0x0001
#define DMA_TCD_CSR_MAJORLINKCH(n)       (((n) & 0x1F) << 8)
#define DMA_TCD_CSR_MAJORLINKCH_MASK     0x1F00
/* TCD BITER linking bits */
#define DMA_TCD_BITER_ELINK                 ((uint16_t)1<<15)
#define DMA_TCD_BITER_ELINKYES_ELINK        0x8000
#define DMA_TCD_BITER_ELINKYES_LINKCH(n)    (((n) & 0x1F) << 9)
#define DMA_TCD_BITER_ELINKYES_LINKCH_MASK  0x3E00
/* DMAMUX (base 0x40074000): CHCFG0..31, 4 bytes apart */
#define DMAMUX_CHCFG0      (*(volatile uint32_t *)0x40074000u)
#define DMAMUX_CHCFG_ENBL  ((uint32_t)(1<<31))
#define DMAMUX_CHCFG_TRIG  ((uint32_t)(1<<30))
#define DMAMUX_CHCFG_A_ON  ((uint32_t)(1<<29))
/* eDMA clock gate: CCM LPCG22 (kCLOCK_Edma=22 -> 0x40CC6000 + 22*0x20). */
#define CCM_LPCG22_DIRECT  (*(volatile uint32_t *)0x40CC62C0u)
/* DMAMUX request sources (RT1176 silicon; NXP PERI_DMAMUX.h; matches QEMU wiring) */
#define DMAMUX_SOURCE_LPUART1_TX 8
#define DMAMUX_SOURCE_LPUART1_RX 9
#define DMAMUX_SOURCE_LPSPI1_RX  36
#define DMAMUX_SOURCE_LPSPI1_TX  37
#define DMAMUX_SOURCE_LPI2C1     48
#define DMAMUX_SOURCE_SAI1_RX    54
#define DMAMUX_SOURCE_SAI1_TX    55

/* FlexSPI1 IP-command registers (for the flash-emulated EEPROM program/erase
 * primitives in cores/imxrt1176/eeprom.c).  Same IP + offsets as the RT1062
 * FlexSPI in cores/teensy4/imxrt.h, retargeted to FlexSPI1 base 0x400CC000. */
#define FLEXSPI_MCR0     (*(volatile uint32_t *)(FLEXSPI_BASE + 0x000))
#define FLEXSPI_MCR0_SWRESET     ((uint32_t)(1<<0))
#define FLEXSPI_INTR     (*(volatile uint32_t *)(FLEXSPI_BASE + 0x014))
#define FLEXSPI_INTR_IPCMDDONE   ((uint32_t)(1<<0))
#define FLEXSPI_INTR_IPTXWE      ((uint32_t)(1<<6))
#define FLEXSPI_LUTKEY   (*(volatile uint32_t *)(FLEXSPI_BASE + 0x018))
#define FLEXSPI_LUTKEY_VALUE     ((uint32_t)0x5AF05AF0)
#define FLEXSPI_LUTCR    (*(volatile uint32_t *)(FLEXSPI_BASE + 0x01C))
#define FLEXSPI_LUTCR_UNLOCK     ((uint32_t)(1<<1))
#define FLEXSPI_IPCR0    (*(volatile uint32_t *)(FLEXSPI_BASE + 0x0A0))
#define FLEXSPI_IPCR1    (*(volatile uint32_t *)(FLEXSPI_BASE + 0x0A4))
#define FLEXSPI_IPCR1_ISEQID(n)  ((uint32_t)(((n) & 0x0F) << 16))
#define FLEXSPI_IPCR1_IDATSZ(n)  ((uint32_t)(((n) & 0xFFFF) << 0))
#define FLEXSPI_IPCMD    (*(volatile uint32_t *)(FLEXSPI_BASE + 0x0B0))
#define FLEXSPI_IPCMD_TRG        ((uint32_t)(1<<0))
#define FLEXSPI_IPRXFCR  (*(volatile uint32_t *)(FLEXSPI_BASE + 0x0B8))
#define FLEXSPI_IPRXFCR_CLRIPRXF ((uint32_t)(1<<0))
#define FLEXSPI_IPTXFCR  (*(volatile uint32_t *)(FLEXSPI_BASE + 0x0BC))
#define FLEXSPI_IPTXFCR_CLRIPTXF ((uint32_t)(1<<0))
#define FLEXSPI_RFDR0    (*(volatile uint32_t *)(FLEXSPI_BASE + 0x100))
#define FLEXSPI_TFDR0    (*(volatile uint32_t *)(FLEXSPI_BASE + 0x180))
#define FLEXSPI_LUT60    (*(volatile uint32_t *)(FLEXSPI_BASE + 0x2F0))
#define FLEXSPI_LUT61    (*(volatile uint32_t *)(FLEXSPI_BASE + 0x2F4))
#define FLEXSPI_LUT62    (*(volatile uint32_t *)(FLEXSPI_BASE + 0x2F8))
#define FLEXSPI_LUT63    (*(volatile uint32_t *)(FLEXSPI_BASE + 0x2FC))
#define FLEXSPI_LUT_INSTRUCTION(opcode, pads, operand) ((uint32_t)(\
	(((opcode) & 0x3F) << 10) | (((pads) & 0x03) << 8) | ((operand) & 0xFF)))
#define FLEXSPI_LUT_OPCODE_CMD_SDR   0x01
#define FLEXSPI_LUT_OPCODE_RADDR_SDR 0x02
#define FLEXSPI_LUT_OPCODE_WRITE_SDR 0x08
#define FLEXSPI_LUT_OPCODE_READ_SDR  0x09
#define FLEXSPI_LUT_NUM_PADS_1       0x00
#define FLEXSPI_LUT_NUM_PADS_4       0x02

