newdigate/teensy-cores/imxrt1176/imxrt1176.h
/* SEMC SDRAM pads (SDK semc/sdram pin_mux.c): all IOMUXC MUX_MODE=ALT0,
 * pad-ctl 0x08 = PDRV high-drive + internal pulldown (incl. CLK/CLKX). */
#define SEMC_PAD_MUX_ALT 0x0u
#define SEMC_PAD_CTL_VAL 0x08u
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_00 (*(volatile uint32_t *)0x400E8010u) /* SEMC_DATA00 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_01 (*(volatile uint32_t *)0x400E8014u) /* SEMC_DATA01 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_02 (*(volatile uint32_t *)0x400E8018u) /* SEMC_DATA02 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_03 (*(volatile uint32_t *)0x400E801Cu) /* SEMC_DATA03 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_04 (*(volatile uint32_t *)0x400E8020u) /* SEMC_DATA04 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_05 (*(volatile uint32_t *)0x400E8024u) /* SEMC_DATA05 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_06 (*(volatile uint32_t *)0x400E8028u) /* SEMC_DATA06 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_07 (*(volatile uint32_t *)0x400E802Cu) /* SEMC_DATA07 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_08 (*(volatile uint32_t *)0x400E8030u) /* SEMC_DM00 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_09 (*(volatile uint32_t *)0x400E8034u) /* SEMC_ADDR00 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_10 (*(volatile uint32_t *)0x400E8038u) /* SEMC_ADDR01 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_11 (*(volatile uint32_t *)0x400E803Cu) /* SEMC_ADDR02 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_12 (*(volatile uint32_t *)0x400E8040u) /* SEMC_ADDR03 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_13 (*(volatile uint32_t *)0x400E8044u) /* SEMC_ADDR04 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_14 (*(volatile uint32_t *)0x400E8048u) /* SEMC_ADDR05 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_15 (*(volatile uint32_t *)0x400E804Cu) /* SEMC_ADDR06 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_16 (*(volatile uint32_t *)0x400E8050u) /* SEMC_ADDR07 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_17 (*(volatile uint32_t *)0x400E8054u) /* SEMC_ADDR08 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_18 (*(volatile uint32_t *)0x400E8058u) /* SEMC_ADDR09 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_19 (*(volatile uint32_t *)0x400E805Cu) /* SEMC_ADDR11 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_20 (*(volatile uint32_t *)0x400E8060u) /* SEMC_ADDR12 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_21 (*(volatile uint32_t *)0x400E8064u) /* SEMC_BA0 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_22 (*(volatile uint32_t *)0x400E8068u) /* SEMC_BA1 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_23 (*(volatile uint32_t *)0x400E806Cu) /* SEMC_ADDR10 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_24 (*(volatile uint32_t *)0x400E8070u) /* SEMC_CAS */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_25 (*(volatile uint32_t *)0x400E8074u) /* SEMC_RAS */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_26 (*(volatile uint32_t *)0x400E8078u) /* SEMC_CLK */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_27 (*(volatile uint32_t *)0x400E807Cu) /* SEMC_CKE */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_28 (*(volatile uint32_t *)0x400E8080u) /* SEMC_WE */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_29 (*(volatile uint32_t *)0x400E8084u) /* SEMC_CS0 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_30 (*(volatile uint32_t *)0x400E8088u) /* SEMC_DATA08 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_31 (*(volatile uint32_t *)0x400E808Cu) /* SEMC_DATA09 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_32 (*(volatile uint32_t *)0x400E8090u) /* SEMC_DATA10 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_33 (*(volatile uint32_t *)0x400E8094u) /* SEMC_DATA11 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_34 (*(volatile uint32_t *)0x400E8098u) /* SEMC_DATA12 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_35 (*(volatile uint32_t *)0x400E809Cu) /* SEMC_DATA13 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_36 (*(volatile uint32_t *)0x400E80A0u) /* SEMC_DATA14 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_37 (*(volatile uint32_t *)0x400E80A4u) /* SEMC_DATA15 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_38 (*(volatile uint32_t *)0x400E80A8u) /* SEMC_DM01 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_39 (*(volatile uint32_t *)0x400E80ACu) /* SEMC_DQS */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_40 (*(volatile uint32_t *)0x400E80B0u) /* SEMC_RDY */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_41 (*(volatile uint32_t *)0x400E80B4u) /* SEMC_CSX00 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B2_00 (*(volatile uint32_t *)0x400E80B8u) /* SEMC_DATA16 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B2_01 (*(volatile uint32_t *)0x400E80BCu) /* SEMC_DATA17 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B2_02 (*(volatile uint32_t *)0x400E80C0u) /* SEMC_DATA18 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B2_03 (*(volatile uint32_t *)0x400E80C4u) /* SEMC_DATA19 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B2_04 (*(volatile uint32_t *)0x400E80C8u) /* SEMC_DATA20 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B2_05 (*(volatile uint32_t *)0x400E80CCu) /* SEMC_DATA21 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B2_06 (*(volatile uint32_t *)0x400E80D0u) /* SEMC_DATA22 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B2_07 (*(volatile uint32_t *)0x400E80D4u) /* SEMC_DATA23 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B2_08 (*(volatile uint32_t *)0x400E80D8u) /* SEMC_DM02 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B2_09 (*(volatile uint32_t *)0x400E80DCu) /* SEMC_DATA24 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B2_10 (*(volatile uint32_t *)0x400E80E0u) /* SEMC_DATA25 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B2_11 (*(volatile uint32_t *)0x400E80E4u) /* SEMC_DATA26 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B2_12 (*(volatile uint32_t *)0x400E80E8u) /* SEMC_DATA27 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B2_13 (*(volatile uint32_t *)0x400E80ECu) /* SEMC_DATA28 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B2_14 (*(volatile uint32_t *)0x400E80F0u) /* SEMC_DATA29 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B2_15 (*(volatile uint32_t *)0x400E80F4u) /* SEMC_DATA30 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B2_16 (*(volatile uint32_t *)0x400E80F8u) /* SEMC_DATA31 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B2_17 (*(volatile uint32_t *)0x400E80FCu) /* SEMC_DM03 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B2_18 (*(volatile uint32_t *)0x400E8100u) /* SEMC_DQS4 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B2_19 (*(volatile uint32_t *)0x400E8104u) /* SEMC_CLKX00 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B2_20 (*(volatile uint32_t *)0x400E8108u) /* SEMC_CLKX01 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B1_00 (*(volatile uint32_t *)0x400E8254u) /* SEMC_DATA00 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B1_01 (*(volatile uint32_t *)0x400E8258u) /* SEMC_DATA01 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B1_02 (*(volatile uint32_t *)0x400E825Cu) /* SEMC_DATA02 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B1_03 (*(volatile uint32_t *)0x400E8260u) /* SEMC_DATA03 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B1_04 (*(volatile uint32_t *)0x400E8264u) /* SEMC_DATA04 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B1_05 (*(volatile uint32_t *)0x400E8268u) /* SEMC_DATA05 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B1_06 (*(volatile uint32_t *)0x400E826Cu) /* SEMC_DATA06 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B1_07 (*(volatile uint32_t *)0x400E8270u) /* SEMC_DATA07 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B1_08 (*(volatile uint32_t *)0x400E8274u) /* SEMC_DM00 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B1_09 (*(volatile uint32_t *)0x400E8278u) /* SEMC_ADDR00 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B1_10 (*(volatile uint32_t *)0x400E827Cu) /* SEMC_ADDR01 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B1_11 (*(volatile uint32_t *)0x400E8280u) /* SEMC_ADDR02 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B1_12 (*(volatile uint32_t *)0x400E8284u) /* SEMC_ADDR03 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B1_13 (*(volatile uint32_t *)0x400E8288u) /* SEMC_ADDR04 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B1_14 (*(volatile uint32_t *)0x400E828Cu) /* SEMC_ADDR05 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B1_15 (*(volatile uint32_t *)0x400E8290u) /* SEMC_ADDR06 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B1_16 (*(volatile uint32_t *)0x400E8294u) /* SEMC_ADDR07 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B1_17 (*(volatile uint32_t *)0x400E8298u) /* SEMC_ADDR08 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B1_18 (*(volatile uint32_t *)0x400E829Cu) /* SEMC_ADDR09 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B1_19 (*(volatile uint32_t *)0x400E82A0u) /* SEMC_ADDR11 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B1_20 (*(volatile uint32_t *)0x400E82A4u) /* SEMC_ADDR12 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B1_21 (*(volatile uint32_t *)0x400E82A8u) /* SEMC_BA0 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B1_22 (*(volatile uint32_t *)0x400E82ACu) /* SEMC_BA1 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B1_23 (*(volatile uint32_t *)0x400E82B0u) /* SEMC_ADDR10 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B1_24 (*(volatile uint32_t *)0x400E82B4u) /* SEMC_CAS */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B1_25 (*(volatile uint32_t *)0x400E82B8u) /* SEMC_RAS */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B1_26 (*(volatile uint32_t *)0x400E82BCu) /* SEMC_CLK */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B1_27 (*(volatile uint32_t *)0x400E82C0u) /* SEMC_CKE */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B1_28 (*(volatile uint32_t *)0x400E82C4u) /* SEMC_WE */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B1_29 (*(volatile uint32_t *)0x400E82C8u) /* SEMC_CS0 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B1_30 (*(volatile uint32_t *)0x400E82CCu) /* SEMC_DATA08 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B1_31 (*(volatile uint32_t *)0x400E82D0u) /* SEMC_DATA09 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B1_32 (*(volatile uint32_t *)0x400E82D4u) /* SEMC_DATA10 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B1_33 (*(volatile uint32_t *)0x400E82D8u) /* SEMC_DATA11 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B1_34 (*(volatile uint32_t *)0x400E82DCu) /* SEMC_DATA12 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B1_35 (*(volatile uint32_t *)0x400E82E0u) /* SEMC_DATA13 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B1_36 (*(volatile uint32_t *)0x400E82E4u) /* SEMC_DATA14 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B1_37 (*(volatile uint32_t *)0x400E82E8u) /* SEMC_DATA15 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B1_38 (*(volatile uint32_t *)0x400E82ECu) /* SEMC_DM01 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B1_39 (*(volatile uint32_t *)0x400E82F0u) /* SEMC_DQS */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B1_40 (*(volatile uint32_t *)0x400E82F4u) /* SEMC_RDY */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B1_41 (*(volatile uint32_t *)0x400E82F8u) /* SEMC_CSX00 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B2_00 (*(volatile uint32_t *)0x400E82FCu) /* SEMC_DATA16 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B2_01 (*(volatile uint32_t *)0x400E8300u) /* SEMC_DATA17 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B2_02 (*(volatile uint32_t *)0x400E8304u) /* SEMC_DATA18 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B2_03 (*(volatile uint32_t *)0x400E8308u) /* SEMC_DATA19 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B2_04 (*(volatile uint32_t *)0x400E830Cu) /* SEMC_DATA20 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B2_05 (*(volatile uint32_t *)0x400E8310u) /* SEMC_DATA21 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B2_06 (*(volatile uint32_t *)0x400E8314u) /* SEMC_DATA22 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B2_07 (*(volatile uint32_t *)0x400E8318u) /* SEMC_DATA23 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B2_08 (*(volatile uint32_t *)0x400E831Cu) /* SEMC_DM02 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B2_09 (*(volatile uint32_t *)0x400E8320u) /* SEMC_DATA24 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B2_10 (*(volatile uint32_t *)0x400E8324u) /* SEMC_DATA25 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B2_11 (*(volatile uint32_t *)0x400E8328u) /* SEMC_DATA26 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B2_12 (*(volatile uint32_t *)0x400E832Cu) /* SEMC_DATA27 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B2_13 (*(volatile uint32_t *)0x400E8330u) /* SEMC_DATA28 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B2_14 (*(volatile uint32_t *)0x400E8334u) /* SEMC_DATA29 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B2_15 (*(volatile uint32_t *)0x400E8338u) /* SEMC_DATA30 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B2_16 (*(volatile uint32_t *)0x400E833Cu) /* SEMC_DATA31 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B2_17 (*(volatile uint32_t *)0x400E8340u) /* SEMC_DM03 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B2_18 (*(volatile uint32_t *)0x400E8344u) /* SEMC_DQS4 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B2_19 (*(volatile uint32_t *)0x400E8348u) /* SEMC_CLKX00 */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_B2_20 (*(volatile uint32_t *)0x400E834Cu) /* SEMC_CLKX01 */

/* SEMC clock: root 4 (kCLOCK_Root_Semc) = SYS_PLL2_PFD1 594MHz / 3 = 198MHz;
 * gate LPCG33 (kCLOCK_Semc). semc_clock_hz = 198000000 for Task 2 timing. */
#define CCM_CLOCK_ROOT4_CONTROL (*(volatile uint32_t *)0x40CC0200u) /* kCLOCK_Root_Semc */
#define CCM_LPCG33_DIRECT       (*(volatile uint32_t *)0x40CC6420u) /* kCLOCK_Semc gate */
#define SEMC_CLOCK_HZ 198000000u  /* SYS_PLL2_PFD1 (594 MHz) / 3 */

/* External SDRAM attribute -> .externalram (imxrt1176.ld ERAM @ 0x80000000) */
#ifndef EXTMEM
#define EXTMEM __attribute__((section(".externalram"), used))
#endif

/* ==== ENET 10/100 (Freescale FEC) @ 0x40424000, IRQ 137 ==== */
/* Register offsets verified against RT1170/periph/PERI_ENET.h */
#define ENET_EIR   (*(volatile uint32_t *)(ENET_BASE + 0x004u))
#define ENET_EIMR  (*(volatile uint32_t *)(ENET_BASE + 0x008u))
#define ENET_RDAR  (*(volatile uint32_t *)(ENET_BASE + 0x010u))
#define ENET_TDAR  (*(volatile uint32_t *)(ENET_BASE + 0x014u))
#define ENET_ECR   (*(volatile uint32_t *)(ENET_BASE + 0x024u))
#define ENET_MMFR  (*(volatile uint32_t *)(ENET_BASE + 0x040u))
#define ENET_MSCR  (*(volatile uint32_t *)(ENET_BASE + 0x044u))
#define ENET_MIBC  (*(volatile uint32_t *)(ENET_BASE + 0x064u))
#define ENET_RCR   (*(volatile uint32_t *)(ENET_BASE + 0x084u))
#define ENET_TCR   (*(volatile uint32_t *)(ENET_BASE + 0x0C4u))
#define ENET_PALR  (*(volatile uint32_t *)(ENET_BASE + 0x0E4u))
#define ENET_PAUR  (*(volatile uint32_t *)(ENET_BASE + 0x0E8u))
#define ENET_OPD   (*(volatile uint32_t *)(ENET_BASE + 0x0ECu))
#define ENET_TFWR  (*(volatile uint32_t *)(ENET_BASE + 0x144u))
#define ENET_RDSR  (*(volatile uint32_t *)(ENET_BASE + 0x180u))
#define ENET_TDSR  (*(volatile uint32_t *)(ENET_BASE + 0x184u))
#define ENET_MRBR  (*(volatile uint32_t *)(ENET_BASE + 0x188u))
#define ENET_TACC  (*(volatile uint32_t *)(ENET_BASE + 0x1C0u))
#define ENET_RACC  (*(volatile uint32_t *)(ENET_BASE + 0x1C4u))
/* ECR bits (verified: RESET=bit0, ETHEREN=bit1, EN1588=bit4, DBSWP=bit8) */
#define ENET_ECR_RESET   (1u<<0)
#define ENET_ECR_ETHEREN (1u<<1)
#define ENET_ECR_EN1588  (1u<<4)
#define ENET_ECR_DBSWP   (1u<<8)
/* EIR/EIMR bits (verified: MII=bit23, RXF=bit25, TXF=bit27) */
#define ENET_EIR_MII (1u<<23)
#define ENET_EIR_RXF (1u<<25)
#define ENET_EIR_TXF (1u<<27)
/* RDAR/TDAR active bit (SDK names the field RDAR/TDAR; mask 0x1000000=bit24) */
#define ENET_RDAR_ACTIVE (1u<<24)
#define ENET_TDAR_ACTIVE (1u<<24)
/* MSCR MII_SPEED field (verified mask 0x7E, shift 1 -> 6-bit field): MDC = ref/((MII_SPEED+1)*2) */
#define ENET_MSCR_MII_SPEED(n) (((n)&0x3Fu)<<1)
/* RCR bits (RT1176 RM / FNET fnet_fec.h; QEMU imx_fec.h): MII_MODE=bit2,
 * RMII_MODE=bit8, DRT(half-duplex)=bit1, FCE=bit5, MAX_FL=[29:16] (14-bit). */
#define ENET_RCR_DRT       (1u<<1)
#define ENET_RCR_MII_MODE  (1u<<2)
#define ENET_RCR_FCE       (1u<<5)
#define ENET_RCR_RMII_MODE (1u<<8)
#define ENET_RCR_MAX_FL(n) (((n)&0x3FFFu)<<16)
/* TCR bits: GTS=bit0, FDEN(full-duplex)=bit2 */
#define ENET_TCR_GTS       (1u<<0)
#define ENET_TCR_FDEN      (1u<<2)
/* MMFR fields (clause-22; verified against ENET_MMFR_ST/OP/TA/PA/RA masks) */
#define ENET_MMFR_ST_01   (1u<<30)
#define ENET_MMFR_OP_READ (2u<<28)
#define ENET_MMFR_OP_WRITE (1u<<28)
#define ENET_MMFR_TA_10   (2u<<16)
#define ENET_MMFR_PA(a)   (((a)&0x1Fu)<<23)
#define ENET_MMFR_RA(r)   (((r)&0x1Fu)<<18)
/* Legacy 8-byte buffer-descriptor status bits: these live in the BD memory
 * structure, not the MMIO register map, so PERI_ENET.h has no masks for
 * them -- standard Freescale/NXP FEC BD layout (same across i.MX RT/
 * Kinetis/Vybrid), per the RT1170 RM ENET chapter. */
#define ENET_TXBD_R  (1u<<15)
#define ENET_TXBD_TO1 (1u<<14)
#define ENET_TXBD_W  (1u<<13)
#define ENET_TXBD_TO2 (1u<<12)
#define ENET_TXBD_L  (1u<<11)
#define ENET_TXBD_TC (1u<<10)
#define ENET_RXBD_E  (1u<<15)
#define ENET_RXBD_W  (1u<<13)
#define ENET_RXBD_L  (1u<<11)
/* RX BD error/status bits (RM legacy RxBD; match FNET + QEMU imx_fec.h) */
#define ENET_RXBD_M  (1u<<8)   /* MISS (promiscuous)          */
#define ENET_RXBD_BC (1u<<7)   /* broadcast                   */
#define ENET_RXBD_MC (1u<<6)   /* multicast                   */
#define ENET_RXBD_LG (1u<<5)   /* frame length violation      */
#define ENET_RXBD_NO (1u<<4)   /* non-octet aligned frame     */
#define ENET_RXBD_CR (1u<<2)   /* CRC/frame error             */
#define ENET_RXBD_OV (1u<<1)   /* FIFO overrun                */
#define ENET_RXBD_TR (1u<<0)   /* frame truncated             */
#define ENET_RXBD_ERR (ENET_RXBD_LG|ENET_RXBD_NO|ENET_RXBD_CR|ENET_RXBD_OV|ENET_RXBD_TR)
/* IOMUXC_GPR ENET fields.  GPR4 offset 0x10, GPR28 offset 0x70 (both
 * verified against the PERI_IOMUXC_GPR.h IOMUXC_GPR_Type struct); absolute-
 * address style matches the existing GPR0/14/16/17/18 defines above (this
 * codebase does not route GPR regs through IOMUXC_GPR_BASE even though that
 * macro exists).  Neither GPR4 nor GPR28 was previously defined. */
#define IOMUXC_GPR_GPR4  (*(volatile uint32_t *)0x400E4010u)
#define IOMUXC_GPR_GPR4_ENET_REF_CLK_DIR (1u<<1)
#define IOMUXC_GPR_GPR28 (*(volatile uint32_t *)0x400E4070u)
#define IOMUXC_GPR_GPR28_CACHE_ENET (1u<<7)
/* ENET clock: root 51 = kCLOCK_Root_Enet1, LPCG gate 112 = kCLOCK_Enet
 * (both confirmed in fsl_clock.h clock_root_t/clock_lpcg_t).  mux=4
 * (SysPll1Div2), div=10 -> 50 MHz matches the SDK enet/txrx_transfer
 * BOARD_InitModuleClock {.mux=4,.div=10}.  Root/LPCG addresses follow the
 * generator's own CCM strides (ROOT n @ 0x40CC0000 + n*0x80; LPCG n DIRECT
 * @ 0x40CC6000 + n*0x20), cross-checked vs ROOT58/LPCG117 above. */
#define CCM_CLOCK_ROOT51_CONTROL (*(volatile uint32_t *)0x40CC1980u)
#define CCM_LPCG112_DIRECT       (*(volatile uint32_t *)0x40CC6E00u)
/* ENET RMII + MDIO + PHY-reset pads (Task 3) -- verified vs fsl_iomuxc.h.
 * DISP_B2/AD pads in the main IOMUXC block @ 0x400E8000; LPSR_12 in the
 * LPSR block @ 0x40C08000.  ENET_*_SELECT_INPUT daisy regs are one-offs,
 * written to literal addresses directly in enet.c (not emitted here). */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_32       (*(volatile uint32_t *)0x400E818Cu) /* ENET_MDC   ALT3 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_33       (*(volatile uint32_t *)0x400E8190u) /* ENET_MDIO  ALT3 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_DISP_B2_02  (*(volatile uint32_t *)0x400E821Cu) /* ENET_TX_DATA00 ALT1 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_DISP_B2_03  (*(volatile uint32_t *)0x400E8220u) /* ENET_TX_DATA01 ALT1 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_DISP_B2_04  (*(volatile uint32_t *)0x400E8224u) /* ENET_TX_EN     ALT1 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_DISP_B2_05  (*(volatile uint32_t *)0x400E8228u) /* ENET_REF_CLK   ALT2 (SION) */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_DISP_B2_06  (*(volatile uint32_t *)0x400E822Cu) /* ENET_RX_DATA00 ALT1 (SION) */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_DISP_B2_07  (*(volatile uint32_t *)0x400E8230u) /* ENET_RX_DATA01 ALT1 (SION) */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_DISP_B2_08  (*(volatile uint32_t *)0x400E8234u) /* ENET_RX_EN     ALT1 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_DISP_B2_09  (*(volatile uint32_t *)0x400E8238u) /* ENET_RX_ER     ALT1 */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_LPSR_12     (*(volatile uint32_t *)0x40C08030u) /* GPIO12_IO12 ALT0xA (PHY reset) */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_32       (*(volatile uint32_t *)0x400E83D0u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_33       (*(volatile uint32_t *)0x400E83D4u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_DISP_B2_02  (*(volatile uint32_t *)0x400E8460u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_DISP_B2_03  (*(volatile uint32_t *)0x400E8464u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_DISP_B2_04  (*(volatile uint32_t *)0x400E8468u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_DISP_B2_05  (*(volatile uint32_t *)0x400E846Cu)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_DISP_B2_06  (*(volatile uint32_t *)0x400E8470u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_DISP_B2_07  (*(volatile uint32_t *)0x400E8474u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_DISP_B2_08  (*(volatile uint32_t *)0x400E8478u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_DISP_B2_09  (*(volatile uint32_t *)0x400E847Cu)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_LPSR_12     (*(volatile uint32_t *)0x40C08070u)

/* --- SNVS RTC (Secure Non-Volatile Storage: HP RTC + LP secure RTC) --- */
#define SNVS_HPLR      (*(volatile uint32_t *)0x40C90000u)
#define SNVS_HPCOMR    (*(volatile uint32_t *)0x40C90004u)
#define SNVS_HPCR      (*(volatile uint32_t *)0x40C90008u)
#define SNVS_HPSR      (*(volatile uint32_t *)0x40C90014u)
#define SNVS_HPRTCMR   (*(volatile uint32_t *)0x40C90024u)
#define SNVS_HPRTCLR   (*(volatile uint32_t *)0x40C90028u)
#define SNVS_HPTAMR    (*(volatile uint32_t *)0x40C9002Cu)
#define SNVS_HPTALR    (*(volatile uint32_t *)0x40C90030u)
#define SNVS_LPLR      (*(volatile uint32_t *)0x40C90034u)
#define SNVS_LPCR      (*(volatile uint32_t *)0x40C90038u)
#define SNVS_LPSR      (*(volatile uint32_t *)0x40C9004Cu)
#define SNVS_LPSRTCMR  (*(volatile uint32_t *)0x40C90050u)
#define SNVS_LPSRTCLR  (*(volatile uint32_t *)0x40C90054u)
#define SNVS_LPGPR0    (*(volatile uint32_t *)0x40C90100u)
#define SNVS_LPGPR1    (*(volatile uint32_t *)0x40C90104u)
#define SNVS_LPGPR2    (*(volatile uint32_t *)0x40C90108u)
#define SNVS_LPGPR3    (*(volatile uint32_t *)0x40C9010Cu)

/* SNVS bitfields (RT1176 RM / PERI_SNVS.h) */
#define SNVS_HPCR_RTC_EN     (1u << 0)   /* HP RTC enable            */
#define SNVS_HPCR_HP_TS      (1u << 16)  /* HP time-sync: load HP<-LP */
#define SNVS_LPCR_SRTC_ENV   (1u << 0)   /* LP secure RTC valid/enable */

