newdigate/teensy-cores/imxrt1176/imxrt1176.h
/* --- DAC12 (12-bit DAC, base 0x40064000, IRQ 63, LPCG 57; Task: analogWriteDAC0) ---
 * PERI_DAC.h / RM ch.89. RT1170 chip-specifics (RM 89.1): VREFH is the ONLY
 * reference (CR.DACRFS must be 1), no HW trigger, no ITRM register, IREF2/PTAT
 * current ref unavailable. DATA is write-only on silicon. */
#define DAC_VERID (*(volatile uint32_t *)0x40064000u)
#define DAC_PARAM (*(volatile uint32_t *)0x40064004u)   /* FIFOSZ[2:0]=0b011 -> 16-word FIFO */
#define DAC_DATA  (*(volatile uint32_t *)0x40064008u)   /* write-only: DATA0[11:0] */
#define DAC_CR    (*(volatile uint32_t *)0x4006400Cu)
#define DAC_PTR   (*(volatile uint32_t *)0x40064010u)
#define DAC_CR2   (*(volatile uint32_t *)0x40064014u)
#define DAC_PARAM_FIFOSZ_MASK   0x7u
#define DAC_DATA_DATA0_MASK     0xFFFu
#define DAC_CR_FULLF_MASK       0x1u        /* ro: FIFO full */
#define DAC_CR_NEMPTF_MASK      0x2u        /* ro: one datum left */
#define DAC_CR_WMF_MASK         0x4u        /* ro: remaining < WML */
#define DAC_CR_UDFF_MASK        0x8u        /* w1c: trigger underflow */
#define DAC_CR_OVFF_MASK        0x10u       /* w1c: FIFO overflow */
#define DAC_CR_FULLIE_MASK      0x100u
#define DAC_CR_EMPTIE_MASK      0x200u
#define DAC_CR_WTMIE_MASK       0x400u
#define DAC_CR_SWTRG_MASK       0x1000u     /* self-clearing */
#define DAC_CR_TRGSEL_MASK      0x2000u     /* 1 = SW trigger (only option on RT1170) */
#define DAC_CR_DACRFS_MASK      0x4000u     /* MUST be 1 on RT1170 (VREFH) */
#define DAC_CR_DACEN_MASK       0x8000u
#define DAC_CR_FIFOEN_MASK      0x10000u
#define DAC_CR_SWMD_MASK        0x20000u
#define DAC_CR_UVIE_MASK        0x40000u
#define DAC_CR_FIFORST_MASK     0x200000u   /* self-clearing */
#define DAC_CR_SWRST_MASK       0x400000u   /* self-clearing */
#define DAC_CR_DMAEN_MASK       0x800000u
#define DAC_CR_WML_SHIFT        24
#define DAC_CR_WML_MASK         0xFF000000u
#define DAC_PTR_DACWFP_MASK     0xFFu
#define DAC_PTR_DACRFP_SHIFT    16
#define DAC_PTR_DACRFP_MASK     0xFF0000u
#define DAC_CR2_BFEN_MASK       0x1u        /* opamp buffer */
#define DAC_CR2_OEN_MASK        0x2u        /* buffer bypassed */
#define DAC_CR2_BFMS_MASK       0x4u
#define DAC_CR2_BFHS_MASK       0x8u
#define DAC_CR2_IREF1_MASK      0x20u       /* ZTC current ref */
#define DAC_CR2_IREF_MASK       0x40u       /* internal current ref (SDK default) */
/* DAC clock gate: kCLOCK_Dac = LPCG 57 (0x40CC6000 + 57*0x20). */
#define CCM_LPCG57_DIRECT (*(volatile uint32_t *)0x40CC6720u)

/* --- PXP (Pixel Pipeline) 2D graphics accelerator --------------------------
 * RM rev.5 ch.52.  Base 0x40814000, IRQ 57, clock gate LPCG127 (BUS_CLK_ROOT).
 * NOTE: CTRL resets to 0xC000_0000 - SFTRST and CLKGATE are BOTH SET, so the
 * block is held dead until the RM 52.5 sequence runs (set SFTRST; then clear
 * SFTRST and CLKGATE).  Registers at +0x4/+0x8/+0xC are MXS SET/CLR/TOG
 * aliases of the base register. */
#define PXP_BASE                  0x40814000u
#define PXP_REG(off)              (*(volatile uint32_t *)(PXP_BASE + (off)))

#define PXP_CTRL                  PXP_REG(0x000)
#define PXP_CTRL_SET              PXP_REG(0x004)
#define PXP_CTRL_CLR              PXP_REG(0x008)
#define PXP_CTRL_TOG              PXP_REG(0x00C)
#define PXP_STAT                  PXP_REG(0x010)
#define PXP_STAT_SET              PXP_REG(0x014)
#define PXP_STAT_CLR              PXP_REG(0x018)
#define PXP_STAT_TOG              PXP_REG(0x01C)
#define PXP_OUT_CTRL              PXP_REG(0x020)
#define PXP_OUT_CTRL_SET          PXP_REG(0x024)
#define PXP_OUT_CTRL_CLR          PXP_REG(0x028)
#define PXP_OUT_CTRL_TOG          PXP_REG(0x02C)
#define PXP_OUT_BUF               PXP_REG(0x030)
#define PXP_OUT_BUF2              PXP_REG(0x040)
#define PXP_OUT_PITCH             PXP_REG(0x050)
#define PXP_OUT_LRC               PXP_REG(0x060)
#define PXP_OUT_PS_ULC            PXP_REG(0x070)
#define PXP_OUT_PS_LRC            PXP_REG(0x080)
#define PXP_OUT_AS_ULC            PXP_REG(0x090)
#define PXP_OUT_AS_LRC            PXP_REG(0x0A0)
#define PXP_PS_CTRL               PXP_REG(0x0B0)
#define PXP_PS_CTRL_SET           PXP_REG(0x0B4)
#define PXP_PS_CTRL_CLR           PXP_REG(0x0B8)
#define PXP_PS_CTRL_TOG           PXP_REG(0x0BC)
#define PXP_PS_BUF                PXP_REG(0x0C0)
#define PXP_PS_UBUF               PXP_REG(0x0D0)
#define PXP_PS_VBUF               PXP_REG(0x0E0)
#define PXP_PS_PITCH              PXP_REG(0x0F0)
#define PXP_PS_BACKGROUND         PXP_REG(0x100)
#define PXP_PS_SCALE              PXP_REG(0x110)
#define PXP_PS_OFFSET             PXP_REG(0x120)
#define PXP_PS_CLRKEYLOW          PXP_REG(0x130)
#define PXP_PS_CLRKEYHIGH         PXP_REG(0x140)
#define PXP_AS_CTRL               PXP_REG(0x150)
#define PXP_AS_BUF                PXP_REG(0x160)
#define PXP_AS_PITCH              PXP_REG(0x170)
#define PXP_AS_CLRKEYLOW          PXP_REG(0x180)
#define PXP_AS_CLRKEYHIGH         PXP_REG(0x190)
#define PXP_CSC1_COEF0            PXP_REG(0x1A0)
#define PXP_CSC1_COEF1            PXP_REG(0x1B0)
#define PXP_CSC1_COEF2            PXP_REG(0x1C0)
/* CSC1_COEF0 bits.  BYPASS resets to 0, so the PS datapath runs every source
 * pixel through the YUV->RGB colour matrix by default - it MUST be set for an
 * RGB source, or the copy is colour-mangled (HW-confirmed; QEMU does not model
 * CSC1). */
#define PXP_CSC1_BYPASS          ((uint32_t)(1u<<30))
#define PXP_CSC1_YCBCR_MODE      ((uint32_t)(1u<<31))
/* YCbCr->RGB colour-matrix coefficients (studio-range, ITU-R BT.601).  Formula:
 *   R = C0*(Y+Yoff) + C1*(V+UVoff)
 *   G = C0*(Y+Yoff) + C3*(U+UVoff) + C2*(V+UVoff)
 *   B = C0*(Y+Yoff) + C4*(U+UVoff)
 * ***HW-VERIFIED (pxp_csc_color): these are NXP fsl_pxp's kPXP_Csc1YCbCr2RGB
 * values.  The OV5640 (and MIPI/CSI YUV422 generally) emits STUDIO-range YCbCr
 * (Y 16..235, chroma centred at 128), so the conversion needs YCBCR_MODE=1,
 * Y_OFFSET=-16 and the 1.164 luma gain - NOT the full-range YUV2RGB set.  An
 * earlier full-range hybrid (C0=1.0/0x0403_0000 + a stray YCbCr C3) DROPPED
 * luma on silicon and cast everything green (neutral gray -> 0x07E0), which is
 * what broke the camera preview and the M1 self-checksum.
 *   COEF0 = YCBCR_MODE(1)<<31 | C0=0x12A(1.164)<<18 | UV_OFFSET=0x180(-128)<<9
 *           | Y_OFFSET=0x1F0(-16)                      = 0x84AB_01F0
 *   COEF1 = C1=0x198(1.596)<<16 | C4=0x204(2.017)      = 0x0198_0204
 *   COEF2 = C2=0x730(-0.813)<<16 | C3=0x79C(-0.392)    = 0x0730_079C
 * BYPASS(bit30)=0 so the matrix runs; an RGB source must set BYPASS instead. */
#define PXP_CSC1_COEF0_YUV2RGB   ((uint32_t)0x84AB01F0u)
#define PXP_CSC1_COEF1_YUV2RGB   ((uint32_t)0x01980204u)
#define PXP_CSC1_COEF2_YUV2RGB   ((uint32_t)0x0730079Cu)
#define PXP_POWER                 PXP_REG(0x320)
#define PXP_NEXT                  PXP_REG(0x400)
#define PXP_PORTER_DUFF_CTRL      PXP_REG(0x440)

/* CTRL bits - bitmasks, not registers (PXP_CTRL_SET/_CLR/_TOG above are the
 * registers; same PXP_CTRL_ prefix, NXP MXS style) - OR into PXP_CTRL, or
 * write one alone into PXP_CTRL_SET/_CLR for an atomic set/clear. */
#define PXP_CTRL_ENABLE           ((uint32_t)(1u<<0))
#define PXP_CTRL_IRQ_ENABLE       ((uint32_t)(1u<<1))
#define PXP_CTRL_NEXT_IRQ_ENABLE  ((uint32_t)(1u<<2))
#define PXP_CTRL_ROTATE_SHIFT     8
#define PXP_CTRL_ROTATE_MASK      ((uint32_t)(3u<<8))
#define PXP_CTRL_HFLIP            ((uint32_t)(1u<<10))
#define PXP_CTRL_VFLIP            ((uint32_t)(1u<<11))
#define PXP_CTRL_ROT_POS          ((uint32_t)(1u<<22))  /* 0=rotate after composite */
#define PXP_CTRL_BLOCK_SIZE       ((uint32_t)(1u<<23))  /* 0=8x8, 1=16x16 blocks   */
#define PXP_CTRL_CLKGATE          ((uint32_t)(1u<<30))
#define PXP_CTRL_SFTRST           ((uint32_t)(1u<<31))

