newdigate/teensy-cores/imxrt1176/imxrt1176.h
/* --- Display-interface plumbing (SoC-level, OUTSIDE the DSI register file) --
 * The MIPI-DSI host does NOT come out of chip reset usable, and nothing in its
 * own register file says so.  Three separate blocks gate it, and NXP's
 * BOARD_InitDisplayInterface() (mcuxsdk-examples _boards/evkbmimxrt1170/
 * display_support.c, BSD-3-Clause) touches all three:
 *   - IOMUXC_GPR62[19:16]: the four MIPI-DSI clock-domain soft resets.  ALL
 *     ACTIVE LOW and NOT self-clearing -- writing 1 RELEASES that domain, and
 *     the POR value 0000_02DBh has all four CLEAR ("by default it holds the
 *     MIPI DSI in reset state").  GPR62 must be READ-MODIFY-WRITTEN: bits 13:0
 *     of that POR value are D-PHY trim defaults that a blind write destroys.
 *   - VIDEO_MUX VID_MUX_CTRL[MIPI_DSI_SEL]: which display controller feeds the
 *     DSI's DPI input (POR 0 = eLCDIF, NOT LCDIFv2).
 *   - PGMC_BPC4 BPC_POWER_CTRL: the MIPI power domain's soft power-switch /
 *     isolation controls (POR 0 = powered off, isolated).
 * Addresses/offsets/bit positions from the RM sections cited per line below,
 * cross-checked against the SDK peripheral-access headers PERI_IOMUXC_GPR.h /
 * PERI_VIDEO_MUX.h / PERI_PGMC.h (BSD-3-Clause; facts only, re-expressed in
 * this file's #define idiom -- NXP struct typedefs NOT copied). */

/* IOMUXC_GPR62 @ IOMUXC_GPR + F8h -- RM 12.4.5.58 (POR 0000_02DBh, RW). */
#define IOMUXC_GPR62              (*(volatile uint32_t *)(IOMUXC_GPR_BASE + 0xF8u))
/* GPR62 MIPI-DSI soft resets -- RM 12.4.5.58.4.  Active LOW: set = out of
 * reset.  RM field names are by clock domain ("APB"/"Byte"/"Pixel"/"Escape");
 * the mnemonics below are PERI_IOMUXC_GPR.h's. */
#define IOMUXC_GPR62_MIPI_DSI_PCLK_SOFT_RESET_N  ((uint32_t)(1u<<16))  /* APB clock domain    */
#define IOMUXC_GPR62_MIPI_DSI_BYTE_SOFT_RESET_N  ((uint32_t)(1u<<17))  /* byte clock domain   */
#define IOMUXC_GPR62_MIPI_DSI_DPI_SOFT_RESET_N   ((uint32_t)(1u<<18))  /* pixel clock domain  */
#define IOMUXC_GPR62_MIPI_DSI_ESC_SOFT_RESET_N   ((uint32_t)(1u<<19))  /* escape clock domain */

/* VIDEO_MUX @ 4081_8000h -- RM 50.6.1.1.  Every control register is a 16-byte
 * RW/SET/CLR/TOG quad; all reset to 0000_0000h.  v1 only needs VID_MUX_CTRL. */
#define VIDEO_MUX_BASE            0x40818000u
#define VIDEO_MUX_REG(off)        (*(volatile uint32_t *)(VIDEO_MUX_BASE + (off)))
#define VIDEO_MUX_VID_MUX_CTRL        VIDEO_MUX_REG(0x00)  /* RM 50.6.1.2            */
#define VIDEO_MUX_VID_MUX_CTRL_SET    VIDEO_MUX_REG(0x04)  /* write 1 = set bit      */
#define VIDEO_MUX_VID_MUX_CTRL_CLR    VIDEO_MUX_REG(0x08)  /* write 1 = clear bit    */
#define VIDEO_MUX_VID_MUX_CTRL_TOG    VIDEO_MUX_REG(0x0C)  /* write 1 = toggle bit   */
/* VID_MUX_CTRL fields -- RM 50.6.1.2. */
#define VIDEO_MUX_VID_MUX_CTRL_CSI_SEL      ((uint32_t)(1u<<0))  /* CSI sensor data source     */
#define VIDEO_MUX_VID_MUX_CTRL_LCDIF2_SEL   ((uint32_t)(1u<<1))  /* LCDIFv2 sensor data source */
#define VIDEO_MUX_VID_MUX_CTRL_MIPI_DSI_SEL ((uint32_t)(1u<<2))  /* 0=DSI from eLCDIF, 1=from LCDIFv2 */
#define VIDEO_MUX_VID_MUX_CTRL_PARA_LCD_SEL ((uint32_t)(1u<<3))  /* parallel LCDIF data source */
/* VIDEO_MUX clock gate: LPCG136 (kCLOCK_Video_Mux, fsl_clock.h) =
 * 0x40CC6000 + 136*0x20.  BOARD_InitDisplayInterface() ungates it first. */
#define CCM_LPCG136_DIRECT        (*(volatile uint32_t *)0x40CC7100u)

/* PGMC basic power controllers: PGMC_BPCn @ 40C8_8000h + n*200h -- RM 20.6.1.1.
 * BPC4 (40C8_8800h) is the MIPI power domain. */
#define PGMC_BPC4_BASE            0x40C88800u
#define PGMC_BPC4_BPC_POWER_CTRL  (*(volatile uint32_t *)(PGMC_BPC4_BASE + 0x14u)) /* RM 20.6.1.4, POR 0 */
/* BPC_POWER_CTRL fields -- RM 20.6.1.4.4. */
#define PGMC_BPC_POWER_CTRL_PSW_ON_SOFT   ((uint32_t)(1u<<10))  /* software power-on trigger    */
#define PGMC_BPC_POWER_CTRL_ISO_OFF_SOFT  ((uint32_t)(1u<<11))  /* software isolation-off trigger */

/* --- Display clocks (Task 6 consumes these) --------------------------------
 * VIDEO PLL in ANATOP (base 0x40C84000, same block as ARM/AUDIO PLL above);
 * offsets from PERI_ANADIG_PLL.h.  On RT1176 the fractional-N config
 * (DIV_SELECT/NUM/DENOM) is normally written via the ANATOP AI protocol (cf.
 * the AUDIO PLL AI regs above) unless PLL_VIDEO_CTRL.CONTROL_MODE selects
 * direct mode -- Task 6 decides.  CCM CLOCK_ROOT/LPCG addresses follow the
 * existing conventions: CLOCK_ROOTn @ 0x40CC0000 + n*0x80, LPCGn @ 0x40CC6000
 * + n*0x20.  Root/gate indices from fsl_clock.h. */
#define ANADIG_PLL_VIDEO_CTRL         (*(volatile uint32_t *)0x40C84350u) /* ANATOP +0x350 */
#define ANADIG_PLL_VIDEO_SS           (*(volatile uint32_t *)0x40C84360u) /* +0x360 spread-spectrum */
#define ANADIG_PLL_VIDEO_DENOMINATOR  (*(volatile uint32_t *)0x40C84370u) /* +0x370 [29:0] */
#define ANADIG_PLL_VIDEO_NUMERATOR    (*(volatile uint32_t *)0x40C84380u) /* +0x380 [29:0] */
#define ANADIG_PLL_VIDEO_DIV_SELECT   (*(volatile uint32_t *)0x40C84390u) /* +0x390 [6:0]  */
#define ANADIG_PLL_VIDEO_CTRL_ENABLE_CLK   (1u<<13)
#define ANADIG_PLL_VIDEO_CTRL_GATE         (1u<<14)   /* PLL_VIDEO_GATE          */
#define ANADIG_PLL_VIDEO_CTRL_COUNTER_CLR  (1u<<24)
#define ANADIG_PLL_VIDEO_CTRL_STABLE       (1u<<29)   /* RO PLL_VIDEO_STABLE     */
#define ANADIG_PLL_VIDEO_CTRL_AI_BUSY      (1u<<30)   /* RO                      */
#define ANADIG_PLL_VIDEO_CTRL_CONTROL_MODE (1u<<31)   /* 1=direct-register mode  */
#define ANADIG_PLL_VIDEO_DIV_SELECT_MASK   ((uint32_t)0x7Fu)
#define ANADIG_PLL_VIDEO_NUM_MASK          ((uint32_t)0x3FFFFFFFu)
#define ANADIG_PLL_VIDEO_DENOM_MASK        ((uint32_t)0x3FFFFFFFu)
#define ANADIG_PLL_VIDEO_SS_STEP(x)        (((uint32_t)(x) << 0) & 0x00007FFFu)
#define ANADIG_PLL_VIDEO_SS_ENABLE         (1u<<15)
#define ANADIG_PLL_VIDEO_SS_STOP(x)        (((uint32_t)(x) << 16) & 0xFFFF0000u)
/* LCDIFv2 clock: CLOCK_ROOT70 (kCLOCK_Root_Lcdifv2) + gate LPCG130 */
#define CCM_CLOCK_ROOT70_CONTROL      (*(volatile uint32_t *)0x40CC2300u)  /* LCDIFv2 root */
#define CCM_LPCG130_DIRECT            (*(volatile uint32_t *)0x40CC7040u)  /* LCDIFv2 gate */
/* MIPI clocks: CLOCK_ROOT71 = MIPI_REF (kCLOCK_Root_Mipi_Ref), CLOCK_ROOT72 =
 * MIPI_ESC (kCLOCK_Root_Mipi_Esc); DSI-host gate LPCG131 (kCLOCK_Mipi_Dsi).
 * On both roots the VIDEO PLL output is mux select 7. */
#define CCM_CLOCK_ROOT71_CONTROL      (*(volatile uint32_t *)0x40CC2380u)  /* MIPI_REF root */
#define CCM_CLOCK_ROOT72_CONTROL      (*(volatile uint32_t *)0x40CC2400u)  /* MIPI_ESC root */
#define CCM_LPCG131_DIRECT            (*(volatile uint32_t *)0x40CC7060u)  /* MIPI_DSI gate */
#define CCM_CLOCK_ROOT_MUX_VIDEO_PLL  7u   /* MUX value: VideoPllOut on LCDIFv2/MIPI_REF/MIPI_ESC roots */
/* MUX value 1 = MuxOsc24MOut (the 24 MHz crystal oscillator) on those same
 * three roots -- fsl_clock.h kCLOCK_{LCDIFV2,MIPI_REF,MIPI_ESC}_ClockRoot_
 * MuxOsc24MOut, all = 1U.  BOARD_InitMipiDsiClock() uses it (mux 1, div 1) for
 * the MIPI D-PHY reference clock. */
#define CCM_CLOCK_ROOT_MUX_OSC_24M    1u

/* --- MIPI-DSI panel control pads (EVKB J48 40-pin FPC connector) ------------
 * The three plain digital outputs a MIPI panel board needs out-of-band: reset,
 * backlight enable and panel power.  Register facts from
 *   mcuxsdk devices/RT/RT1170/MIMXRT1176/drivers/fsl_iomuxc.h
 * whose IOMUXC_<pad>_<signal> macros expand to
 *   muxRegister, muxMode, inputRegister, inputDaisy, configRegister:
 *   IOMUXC_GPIO_AD_02_GPIO9_IO01        0x400E8114, 0xA, 0, 0, 0x400E8358
 *   IOMUXC_GPIO_AD_30_GPIO9_IO29        0x400E8184, 0xA, 0, 0, 0x400E83C8
 *   IOMUXC_GPIO_DISP_B2_15_GPIO11_IO16  0x400E8250, 0xA, 0, 0, 0x400E8494
 * and the signal->GPIO assignment from
 *   mcuxsdk examples/_boards/evkbmimxrt1170/board.h
 *   BOARD_MIPI_PANEL_RST_GPIO/PIN   = GPIO9,  1
 *   BOARD_MIPI_PANEL_BL_GPIO/PIN    = GPIO9,  29
 *   BOARD_MIPI_PANEL_POWER_GPIO/PIN = GPIO11, 16
 * GPIO9_* / GPIO11_* register accessors are defined near the top of this file.
 * GPIO_AD_30's two registers are already defined above in the LPSPI1 block --
 * the same pad is LPSPI1_SOUT in ALT0 and the panel backlight in ALT10, so an
 * SPI-on-the-Arduino-header sketch and a MIPI panel cannot both have it. */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_02       (*(volatile uint32_t *)0x400E8114u) /* GPIO9_IO01  ALT0xA (MIPI panel reset)     */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_02       (*(volatile uint32_t *)0x400E8358u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_DISP_B2_15  (*(volatile uint32_t *)0x400E8250u) /* GPIO11_IO16 ALT0xA (MIPI panel power)     */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_DISP_B2_15  (*(volatile uint32_t *)0x400E8494u)
/* IOMUXC_SW_MUX/PAD_CTL_PAD_GPIO_AD_30 already defined above (LPSPI1 block) --
 * GPIO9_IO29 ALT0xA is the MIPI panel backlight. */
#define IOMUXC_MUX_MODE_ALT10                  0xAu   /* GPIO on every pad above */

#endif
